espressif/esp-idf/components/soc/esp32s31/register/soc/lp_peri_pms_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** LP_PERI_PMS_LP_SYSREG_CTRL_REG register
 *  lp_sysreg read/write control register
 */
#define LP_PERI_PMS_LP_SYSREG_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0x0)
/** LP_PERI_PMS_READ_TEE_LP_SYSREG : R/W; bitpos: [0]; default: 1;
 *  Configures lp_sysreg registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_SYSREG    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_SYSREG_M  (LP_PERI_PMS_READ_TEE_LP_SYSREG_V << LP_PERI_PMS_READ_TEE_LP_SYSREG_S)
#define LP_PERI_PMS_READ_TEE_LP_SYSREG_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_SYSREG_S  0
/** LP_PERI_PMS_READ_REE0_LP_SYSREG : R/W; bitpos: [1]; default: 0;
 *  Configures lp_sysreg registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_SYSREG    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_SYSREG_M  (LP_PERI_PMS_READ_REE0_LP_SYSREG_V << LP_PERI_PMS_READ_REE0_LP_SYSREG_S)
#define LP_PERI_PMS_READ_REE0_LP_SYSREG_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_SYSREG_S  1
/** LP_PERI_PMS_READ_REE1_LP_SYSREG : R/W; bitpos: [2]; default: 0;
 *  Configures lp_sysreg registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_SYSREG    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_SYSREG_M  (LP_PERI_PMS_READ_REE1_LP_SYSREG_V << LP_PERI_PMS_READ_REE1_LP_SYSREG_S)
#define LP_PERI_PMS_READ_REE1_LP_SYSREG_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_SYSREG_S  2
/** LP_PERI_PMS_READ_REE2_LP_SYSREG : R/W; bitpos: [3]; default: 0;
 *  Configures lp_sysreg registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_SYSREG    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_SYSREG_M  (LP_PERI_PMS_READ_REE2_LP_SYSREG_V << LP_PERI_PMS_READ_REE2_LP_SYSREG_S)
#define LP_PERI_PMS_READ_REE2_LP_SYSREG_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_SYSREG_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_SYSREG : R/W; bitpos: [4]; default: 1;
 *  Configures lp_sysreg registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_SYSREG    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_SYSREG_M  (LP_PERI_PMS_WRITE_TEE_LP_SYSREG_V << LP_PERI_PMS_WRITE_TEE_LP_SYSREG_S)
#define LP_PERI_PMS_WRITE_TEE_LP_SYSREG_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_SYSREG_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_SYSREG : R/W; bitpos: [5]; default: 0;
 *  Configures lp_sysreg registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_SYSREG    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_SYSREG_M  (LP_PERI_PMS_WRITE_REE0_LP_SYSREG_V << LP_PERI_PMS_WRITE_REE0_LP_SYSREG_S)
#define LP_PERI_PMS_WRITE_REE0_LP_SYSREG_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_SYSREG_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_SYSREG : R/W; bitpos: [6]; default: 0;
 *  Configures lp_sysreg registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_SYSREG    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_SYSREG_M  (LP_PERI_PMS_WRITE_REE1_LP_SYSREG_V << LP_PERI_PMS_WRITE_REE1_LP_SYSREG_S)
#define LP_PERI_PMS_WRITE_REE1_LP_SYSREG_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_SYSREG_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_SYSREG : R/W; bitpos: [7]; default: 0;
 *  Configures lp_sysreg registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_SYSREG    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_SYSREG_M  (LP_PERI_PMS_WRITE_REE2_LP_SYSREG_V << LP_PERI_PMS_WRITE_REE2_LP_SYSREG_S)
#define LP_PERI_PMS_WRITE_REE2_LP_SYSREG_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_SYSREG_S  7
/** LP_PERI_PMS_LP_SYSREG_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_sysreg peri_apm configuration
 */
#define LP_PERI_PMS_LP_SYSREG_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_SYSREG_LOCK_M  (LP_PERI_PMS_LP_SYSREG_LOCK_V << LP_PERI_PMS_LP_SYSREG_LOCK_S)
#define LP_PERI_PMS_LP_SYSREG_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_SYSREG_LOCK_S  8

/** LP_PERI_PMS_LP_AONCLKRST_CTRL_REG register
 *  lp_aonclkrst read/write control register
 */
#define LP_PERI_PMS_LP_AONCLKRST_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0x4)
/** LP_PERI_PMS_READ_TEE_LP_AONCLKRST : R/W; bitpos: [0]; default: 1;
 *  Configures lp_aonclkrst registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_AONCLKRST    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_AONCLKRST_M  (LP_PERI_PMS_READ_TEE_LP_AONCLKRST_V << LP_PERI_PMS_READ_TEE_LP_AONCLKRST_S)
#define LP_PERI_PMS_READ_TEE_LP_AONCLKRST_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_AONCLKRST_S  0
/** LP_PERI_PMS_READ_REE0_LP_AONCLKRST : R/W; bitpos: [1]; default: 0;
 *  Configures lp_aonclkrst registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_AONCLKRST    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_AONCLKRST_M  (LP_PERI_PMS_READ_REE0_LP_AONCLKRST_V << LP_PERI_PMS_READ_REE0_LP_AONCLKRST_S)
#define LP_PERI_PMS_READ_REE0_LP_AONCLKRST_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_AONCLKRST_S  1
/** LP_PERI_PMS_READ_REE1_LP_AONCLKRST : R/W; bitpos: [2]; default: 0;
 *  Configures lp_aonclkrst registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_AONCLKRST    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_AONCLKRST_M  (LP_PERI_PMS_READ_REE1_LP_AONCLKRST_V << LP_PERI_PMS_READ_REE1_LP_AONCLKRST_S)
#define LP_PERI_PMS_READ_REE1_LP_AONCLKRST_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_AONCLKRST_S  2
/** LP_PERI_PMS_READ_REE2_LP_AONCLKRST : R/W; bitpos: [3]; default: 0;
 *  Configures lp_aonclkrst registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_AONCLKRST    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_AONCLKRST_M  (LP_PERI_PMS_READ_REE2_LP_AONCLKRST_V << LP_PERI_PMS_READ_REE2_LP_AONCLKRST_S)
#define LP_PERI_PMS_READ_REE2_LP_AONCLKRST_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_AONCLKRST_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_AONCLKRST : R/W; bitpos: [4]; default: 1;
 *  Configures lp_aonclkrst registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_AONCLKRST    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_AONCLKRST_M  (LP_PERI_PMS_WRITE_TEE_LP_AONCLKRST_V << LP_PERI_PMS_WRITE_TEE_LP_AONCLKRST_S)
#define LP_PERI_PMS_WRITE_TEE_LP_AONCLKRST_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_AONCLKRST_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_AONCLKRST : R/W; bitpos: [5]; default: 0;
 *  Configures lp_aonclkrst registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_AONCLKRST    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_AONCLKRST_M  (LP_PERI_PMS_WRITE_REE0_LP_AONCLKRST_V << LP_PERI_PMS_WRITE_REE0_LP_AONCLKRST_S)
#define LP_PERI_PMS_WRITE_REE0_LP_AONCLKRST_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_AONCLKRST_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_AONCLKRST : R/W; bitpos: [6]; default: 0;
 *  Configures lp_aonclkrst registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_AONCLKRST    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_AONCLKRST_M  (LP_PERI_PMS_WRITE_REE1_LP_AONCLKRST_V << LP_PERI_PMS_WRITE_REE1_LP_AONCLKRST_S)
#define LP_PERI_PMS_WRITE_REE1_LP_AONCLKRST_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_AONCLKRST_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_AONCLKRST : R/W; bitpos: [7]; default: 0;
 *  Configures lp_aonclkrst registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_AONCLKRST    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_AONCLKRST_M  (LP_PERI_PMS_WRITE_REE2_LP_AONCLKRST_V << LP_PERI_PMS_WRITE_REE2_LP_AONCLKRST_S)
#define LP_PERI_PMS_WRITE_REE2_LP_AONCLKRST_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_AONCLKRST_S  7
/** LP_PERI_PMS_LP_AONCLKRST_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_aonclkrst peri_apm configuration
 */
#define LP_PERI_PMS_LP_AONCLKRST_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_AONCLKRST_LOCK_M  (LP_PERI_PMS_LP_AONCLKRST_LOCK_V << LP_PERI_PMS_LP_AONCLKRST_LOCK_S)
#define LP_PERI_PMS_LP_AONCLKRST_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_AONCLKRST_LOCK_S  8

/** LP_PERI_PMS_LP_ANAPERI_CTRL_REG register
 *  lp_anaperi read/write control register
 */
#define LP_PERI_PMS_LP_ANAPERI_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0x8)
/** LP_PERI_PMS_READ_TEE_LP_ANAPERI : R/W; bitpos: [0]; default: 1;
 *  Configures lp_anaperi registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_ANAPERI    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_ANAPERI_M  (LP_PERI_PMS_READ_TEE_LP_ANAPERI_V << LP_PERI_PMS_READ_TEE_LP_ANAPERI_S)
#define LP_PERI_PMS_READ_TEE_LP_ANAPERI_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_ANAPERI_S  0
/** LP_PERI_PMS_READ_REE0_LP_ANAPERI : R/W; bitpos: [1]; default: 0;
 *  Configures lp_anaperi registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_ANAPERI    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_ANAPERI_M  (LP_PERI_PMS_READ_REE0_LP_ANAPERI_V << LP_PERI_PMS_READ_REE0_LP_ANAPERI_S)
#define LP_PERI_PMS_READ_REE0_LP_ANAPERI_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_ANAPERI_S  1
/** LP_PERI_PMS_READ_REE1_LP_ANAPERI : R/W; bitpos: [2]; default: 0;
 *  Configures lp_anaperi registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_ANAPERI    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_ANAPERI_M  (LP_PERI_PMS_READ_REE1_LP_ANAPERI_V << LP_PERI_PMS_READ_REE1_LP_ANAPERI_S)
#define LP_PERI_PMS_READ_REE1_LP_ANAPERI_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_ANAPERI_S  2
/** LP_PERI_PMS_READ_REE2_LP_ANAPERI : R/W; bitpos: [3]; default: 0;
 *  Configures lp_anaperi registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_ANAPERI    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_ANAPERI_M  (LP_PERI_PMS_READ_REE2_LP_ANAPERI_V << LP_PERI_PMS_READ_REE2_LP_ANAPERI_S)
#define LP_PERI_PMS_READ_REE2_LP_ANAPERI_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_ANAPERI_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_ANAPERI : R/W; bitpos: [4]; default: 1;
 *  Configures lp_anaperi registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_ANAPERI    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_ANAPERI_M  (LP_PERI_PMS_WRITE_TEE_LP_ANAPERI_V << LP_PERI_PMS_WRITE_TEE_LP_ANAPERI_S)
#define LP_PERI_PMS_WRITE_TEE_LP_ANAPERI_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_ANAPERI_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_ANAPERI : R/W; bitpos: [5]; default: 0;
 *  Configures lp_anaperi registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_ANAPERI    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_ANAPERI_M  (LP_PERI_PMS_WRITE_REE0_LP_ANAPERI_V << LP_PERI_PMS_WRITE_REE0_LP_ANAPERI_S)
#define LP_PERI_PMS_WRITE_REE0_LP_ANAPERI_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_ANAPERI_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_ANAPERI : R/W; bitpos: [6]; default: 0;
 *  Configures lp_anaperi registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_ANAPERI    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_ANAPERI_M  (LP_PERI_PMS_WRITE_REE1_LP_ANAPERI_V << LP_PERI_PMS_WRITE_REE1_LP_ANAPERI_S)
#define LP_PERI_PMS_WRITE_REE1_LP_ANAPERI_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_ANAPERI_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_ANAPERI : R/W; bitpos: [7]; default: 0;
 *  Configures lp_anaperi registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_ANAPERI    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_ANAPERI_M  (LP_PERI_PMS_WRITE_REE2_LP_ANAPERI_V << LP_PERI_PMS_WRITE_REE2_LP_ANAPERI_S)
#define LP_PERI_PMS_WRITE_REE2_LP_ANAPERI_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_ANAPERI_S  7
/** LP_PERI_PMS_LP_ANAPERI_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_anaperi peri_apm configuration
 */
#define LP_PERI_PMS_LP_ANAPERI_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_ANAPERI_LOCK_M  (LP_PERI_PMS_LP_ANAPERI_LOCK_V << LP_PERI_PMS_LP_ANAPERI_LOCK_S)
#define LP_PERI_PMS_LP_ANAPERI_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_ANAPERI_LOCK_S  8

/** LP_PERI_PMS_LP_HUK_CTRL_REG register
 *  lp_huk read/write control register
 */
#define LP_PERI_PMS_LP_HUK_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0xc)
/** LP_PERI_PMS_READ_TEE_LP_HUK : R/W; bitpos: [0]; default: 1;
 *  Configures lp_huk registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_HUK    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_HUK_M  (LP_PERI_PMS_READ_TEE_LP_HUK_V << LP_PERI_PMS_READ_TEE_LP_HUK_S)
#define LP_PERI_PMS_READ_TEE_LP_HUK_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_HUK_S  0
/** LP_PERI_PMS_READ_REE0_LP_HUK : R/W; bitpos: [1]; default: 0;
 *  Configures lp_huk registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_HUK    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_HUK_M  (LP_PERI_PMS_READ_REE0_LP_HUK_V << LP_PERI_PMS_READ_REE0_LP_HUK_S)
#define LP_PERI_PMS_READ_REE0_LP_HUK_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_HUK_S  1
/** LP_PERI_PMS_READ_REE1_LP_HUK : R/W; bitpos: [2]; default: 0;
 *  Configures lp_huk registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_HUK    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_HUK_M  (LP_PERI_PMS_READ_REE1_LP_HUK_V << LP_PERI_PMS_READ_REE1_LP_HUK_S)
#define LP_PERI_PMS_READ_REE1_LP_HUK_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_HUK_S  2
/** LP_PERI_PMS_READ_REE2_LP_HUK : R/W; bitpos: [3]; default: 0;
 *  Configures lp_huk registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_HUK    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_HUK_M  (LP_PERI_PMS_READ_REE2_LP_HUK_V << LP_PERI_PMS_READ_REE2_LP_HUK_S)
#define LP_PERI_PMS_READ_REE2_LP_HUK_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_HUK_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_HUK : R/W; bitpos: [4]; default: 1;
 *  Configures lp_huk registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_HUK    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_HUK_M  (LP_PERI_PMS_WRITE_TEE_LP_HUK_V << LP_PERI_PMS_WRITE_TEE_LP_HUK_S)
#define LP_PERI_PMS_WRITE_TEE_LP_HUK_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_HUK_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_HUK : R/W; bitpos: [5]; default: 0;
 *  Configures lp_huk registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_HUK    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_HUK_M  (LP_PERI_PMS_WRITE_REE0_LP_HUK_V << LP_PERI_PMS_WRITE_REE0_LP_HUK_S)
#define LP_PERI_PMS_WRITE_REE0_LP_HUK_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_HUK_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_HUK : R/W; bitpos: [6]; default: 0;
 *  Configures lp_huk registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_HUK    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_HUK_M  (LP_PERI_PMS_WRITE_REE1_LP_HUK_V << LP_PERI_PMS_WRITE_REE1_LP_HUK_S)
#define LP_PERI_PMS_WRITE_REE1_LP_HUK_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_HUK_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_HUK : R/W; bitpos: [7]; default: 0;
 *  Configures lp_huk registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_HUK    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_HUK_M  (LP_PERI_PMS_WRITE_REE2_LP_HUK_V << LP_PERI_PMS_WRITE_REE2_LP_HUK_S)
#define LP_PERI_PMS_WRITE_REE2_LP_HUK_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_HUK_S  7
/** LP_PERI_PMS_LP_HUK_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_huk peri_apm configuration
 */
#define LP_PERI_PMS_LP_HUK_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_HUK_LOCK_M  (LP_PERI_PMS_LP_HUK_LOCK_V << LP_PERI_PMS_LP_HUK_LOCK_S)
#define LP_PERI_PMS_LP_HUK_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_HUK_LOCK_S  8

/** LP_PERI_PMS_LP_PMU_CTRL_REG register
 *  lp_pmu read/write control register
 */
#define LP_PERI_PMS_LP_PMU_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0x10)
/** LP_PERI_PMS_READ_TEE_LP_PMU : R/W; bitpos: [0]; default: 1;
 *  Configures lp_pmu registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_PMU    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_PMU_M  (LP_PERI_PMS_READ_TEE_LP_PMU_V << LP_PERI_PMS_READ_TEE_LP_PMU_S)
#define LP_PERI_PMS_READ_TEE_LP_PMU_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_PMU_S  0
/** LP_PERI_PMS_READ_REE0_LP_PMU : R/W; bitpos: [1]; default: 0;
 *  Configures lp_pmu registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_PMU    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_PMU_M  (LP_PERI_PMS_READ_REE0_LP_PMU_V << LP_PERI_PMS_READ_REE0_LP_PMU_S)
#define LP_PERI_PMS_READ_REE0_LP_PMU_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_PMU_S  1
/** LP_PERI_PMS_READ_REE1_LP_PMU : R/W; bitpos: [2]; default: 0;
 *  Configures lp_pmu registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_PMU    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_PMU_M  (LP_PERI_PMS_READ_REE1_LP_PMU_V << LP_PERI_PMS_READ_REE1_LP_PMU_S)
#define LP_PERI_PMS_READ_REE1_LP_PMU_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_PMU_S  2
/** LP_PERI_PMS_READ_REE2_LP_PMU : R/W; bitpos: [3]; default: 0;
 *  Configures lp_pmu registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_PMU    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_PMU_M  (LP_PERI_PMS_READ_REE2_LP_PMU_V << LP_PERI_PMS_READ_REE2_LP_PMU_S)
#define LP_PERI_PMS_READ_REE2_LP_PMU_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_PMU_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_PMU : R/W; bitpos: [4]; default: 1;
 *  Configures lp_pmu registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_PMU    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_PMU_M  (LP_PERI_PMS_WRITE_TEE_LP_PMU_V << LP_PERI_PMS_WRITE_TEE_LP_PMU_S)
#define LP_PERI_PMS_WRITE_TEE_LP_PMU_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_PMU_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_PMU : R/W; bitpos: [5]; default: 0;
 *  Configures lp_pmu registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_PMU    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_PMU_M  (LP_PERI_PMS_WRITE_REE0_LP_PMU_V << LP_PERI_PMS_WRITE_REE0_LP_PMU_S)
#define LP_PERI_PMS_WRITE_REE0_LP_PMU_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_PMU_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_PMU : R/W; bitpos: [6]; default: 0;
 *  Configures lp_pmu registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_PMU    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_PMU_M  (LP_PERI_PMS_WRITE_REE1_LP_PMU_V << LP_PERI_PMS_WRITE_REE1_LP_PMU_S)
#define LP_PERI_PMS_WRITE_REE1_LP_PMU_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_PMU_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_PMU : R/W; bitpos: [7]; default: 0;
 *  Configures lp_pmu registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_PMU    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_PMU_M  (LP_PERI_PMS_WRITE_REE2_LP_PMU_V << LP_PERI_PMS_WRITE_REE2_LP_PMU_S)
#define LP_PERI_PMS_WRITE_REE2_LP_PMU_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_PMU_S  7
/** LP_PERI_PMS_LP_PMU_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_pmu peri_apm configuration
 */
#define LP_PERI_PMS_LP_PMU_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_PMU_LOCK_M  (LP_PERI_PMS_LP_PMU_LOCK_V << LP_PERI_PMS_LP_PMU_LOCK_S)
#define LP_PERI_PMS_LP_PMU_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_PMU_LOCK_S  8

