espressif/esp-idf/components/soc/esp32s31/register/soc/lp_peri_pms_reg.h
/** LP_PERI_PMS_LP_TOUCH_AON_CTRL_REG register
 *  lp_touch_aon read/write control register
 */
#define LP_PERI_PMS_LP_TOUCH_AON_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0x14)
/** LP_PERI_PMS_READ_TEE_LP_TOUCH_AON : R/W; bitpos: [0]; default: 1;
 *  Configures lp_touch_aon registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_TOUCH_AON    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_TOUCH_AON_M  (LP_PERI_PMS_READ_TEE_LP_TOUCH_AON_V << LP_PERI_PMS_READ_TEE_LP_TOUCH_AON_S)
#define LP_PERI_PMS_READ_TEE_LP_TOUCH_AON_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_TOUCH_AON_S  0
/** LP_PERI_PMS_READ_REE0_LP_TOUCH_AON : R/W; bitpos: [1]; default: 0;
 *  Configures lp_touch_aon registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_TOUCH_AON    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_TOUCH_AON_M  (LP_PERI_PMS_READ_REE0_LP_TOUCH_AON_V << LP_PERI_PMS_READ_REE0_LP_TOUCH_AON_S)
#define LP_PERI_PMS_READ_REE0_LP_TOUCH_AON_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_TOUCH_AON_S  1
/** LP_PERI_PMS_READ_REE1_LP_TOUCH_AON : R/W; bitpos: [2]; default: 0;
 *  Configures lp_touch_aon registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_TOUCH_AON    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_TOUCH_AON_M  (LP_PERI_PMS_READ_REE1_LP_TOUCH_AON_V << LP_PERI_PMS_READ_REE1_LP_TOUCH_AON_S)
#define LP_PERI_PMS_READ_REE1_LP_TOUCH_AON_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_TOUCH_AON_S  2
/** LP_PERI_PMS_READ_REE2_LP_TOUCH_AON : R/W; bitpos: [3]; default: 0;
 *  Configures lp_touch_aon registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_TOUCH_AON    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_TOUCH_AON_M  (LP_PERI_PMS_READ_REE2_LP_TOUCH_AON_V << LP_PERI_PMS_READ_REE2_LP_TOUCH_AON_S)
#define LP_PERI_PMS_READ_REE2_LP_TOUCH_AON_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_TOUCH_AON_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_TOUCH_AON : R/W; bitpos: [4]; default: 1;
 *  Configures lp_touch_aon registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_TOUCH_AON    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_TOUCH_AON_M  (LP_PERI_PMS_WRITE_TEE_LP_TOUCH_AON_V << LP_PERI_PMS_WRITE_TEE_LP_TOUCH_AON_S)
#define LP_PERI_PMS_WRITE_TEE_LP_TOUCH_AON_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_TOUCH_AON_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_TOUCH_AON : R/W; bitpos: [5]; default: 0;
 *  Configures lp_touch_aon registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_TOUCH_AON    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_TOUCH_AON_M  (LP_PERI_PMS_WRITE_REE0_LP_TOUCH_AON_V << LP_PERI_PMS_WRITE_REE0_LP_TOUCH_AON_S)
#define LP_PERI_PMS_WRITE_REE0_LP_TOUCH_AON_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_TOUCH_AON_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_TOUCH_AON : R/W; bitpos: [6]; default: 0;
 *  Configures lp_touch_aon registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_TOUCH_AON    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_TOUCH_AON_M  (LP_PERI_PMS_WRITE_REE1_LP_TOUCH_AON_V << LP_PERI_PMS_WRITE_REE1_LP_TOUCH_AON_S)
#define LP_PERI_PMS_WRITE_REE1_LP_TOUCH_AON_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_TOUCH_AON_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_TOUCH_AON : R/W; bitpos: [7]; default: 0;
 *  Configures lp_touch_aon registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_TOUCH_AON    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_TOUCH_AON_M  (LP_PERI_PMS_WRITE_REE2_LP_TOUCH_AON_V << LP_PERI_PMS_WRITE_REE2_LP_TOUCH_AON_S)
#define LP_PERI_PMS_WRITE_REE2_LP_TOUCH_AON_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_TOUCH_AON_S  7
/** LP_PERI_PMS_LP_TOUCH_AON_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_touch_aon peri_apm configuration
 */
#define LP_PERI_PMS_LP_TOUCH_AON_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_TOUCH_AON_LOCK_M  (LP_PERI_PMS_LP_TOUCH_AON_LOCK_V << LP_PERI_PMS_LP_TOUCH_AON_LOCK_S)
#define LP_PERI_PMS_LP_TOUCH_AON_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_TOUCH_AON_LOCK_S  8

/** LP_PERI_PMS_LP_PERI_PMS_CTRL_REG register
 *  lp_peri_pms read/write control register
 */
#define LP_PERI_PMS_LP_PERI_PMS_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0x18)
/** LP_PERI_PMS_READ_TEE_LP_PERI_PMS : R/W; bitpos: [0]; default: 1;
 *  Configures lp_peri_pms registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_PERI_PMS    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_PERI_PMS_M  (LP_PERI_PMS_READ_TEE_LP_PERI_PMS_V << LP_PERI_PMS_READ_TEE_LP_PERI_PMS_S)
#define LP_PERI_PMS_READ_TEE_LP_PERI_PMS_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_PERI_PMS_S  0
/** LP_PERI_PMS_READ_REE0_LP_PERI_PMS : HRO; bitpos: [1]; default: 0;
 *  Configures lp_peri_pms registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_PERI_PMS    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_PERI_PMS_M  (LP_PERI_PMS_READ_REE0_LP_PERI_PMS_V << LP_PERI_PMS_READ_REE0_LP_PERI_PMS_S)
#define LP_PERI_PMS_READ_REE0_LP_PERI_PMS_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_PERI_PMS_S  1
/** LP_PERI_PMS_READ_REE1_LP_PERI_PMS : HRO; bitpos: [2]; default: 0;
 *  Configures lp_peri_pms registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_PERI_PMS    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_PERI_PMS_M  (LP_PERI_PMS_READ_REE1_LP_PERI_PMS_V << LP_PERI_PMS_READ_REE1_LP_PERI_PMS_S)
#define LP_PERI_PMS_READ_REE1_LP_PERI_PMS_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_PERI_PMS_S  2
/** LP_PERI_PMS_READ_REE2_LP_PERI_PMS : HRO; bitpos: [3]; default: 0;
 *  Configures lp_peri_pms registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_PERI_PMS    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_PERI_PMS_M  (LP_PERI_PMS_READ_REE2_LP_PERI_PMS_V << LP_PERI_PMS_READ_REE2_LP_PERI_PMS_S)
#define LP_PERI_PMS_READ_REE2_LP_PERI_PMS_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_PERI_PMS_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_PERI_PMS : R/W; bitpos: [4]; default: 1;
 *  Configures lp_peri_pms registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_PERI_PMS    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_PERI_PMS_M  (LP_PERI_PMS_WRITE_TEE_LP_PERI_PMS_V << LP_PERI_PMS_WRITE_TEE_LP_PERI_PMS_S)
#define LP_PERI_PMS_WRITE_TEE_LP_PERI_PMS_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_PERI_PMS_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_PERI_PMS : HRO; bitpos: [5]; default: 0;
 *  Configures lp_peri_pms registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_PERI_PMS    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_PERI_PMS_M  (LP_PERI_PMS_WRITE_REE0_LP_PERI_PMS_V << LP_PERI_PMS_WRITE_REE0_LP_PERI_PMS_S)
#define LP_PERI_PMS_WRITE_REE0_LP_PERI_PMS_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_PERI_PMS_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_PERI_PMS : HRO; bitpos: [6]; default: 0;
 *  Configures lp_peri_pms registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_PERI_PMS    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_PERI_PMS_M  (LP_PERI_PMS_WRITE_REE1_LP_PERI_PMS_V << LP_PERI_PMS_WRITE_REE1_LP_PERI_PMS_S)
#define LP_PERI_PMS_WRITE_REE1_LP_PERI_PMS_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_PERI_PMS_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_PERI_PMS : HRO; bitpos: [7]; default: 0;
 *  Configures lp_peri_pms registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_PERI_PMS    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_PERI_PMS_M  (LP_PERI_PMS_WRITE_REE2_LP_PERI_PMS_V << LP_PERI_PMS_WRITE_REE2_LP_PERI_PMS_S)
#define LP_PERI_PMS_WRITE_REE2_LP_PERI_PMS_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_PERI_PMS_S  7
/** LP_PERI_PMS_LP_PERI_PMS_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_peri_pms peri_apm configuration
 */
#define LP_PERI_PMS_LP_PERI_PMS_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_PERI_PMS_LOCK_M  (LP_PERI_PMS_LP_PERI_PMS_LOCK_V << LP_PERI_PMS_LP_PERI_PMS_LOCK_S)
#define LP_PERI_PMS_LP_PERI_PMS_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_PERI_PMS_LOCK_S  8

/** LP_PERI_PMS_LP_TEE_CTRL_REG register
 *  lp_tee read/write control register
 */
#define LP_PERI_PMS_LP_TEE_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0x1c)
/** LP_PERI_PMS_READ_TEE_LP_TEE : R/W; bitpos: [0]; default: 1;
 *  Configures lp_tee registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_TEE    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_TEE_M  (LP_PERI_PMS_READ_TEE_LP_TEE_V << LP_PERI_PMS_READ_TEE_LP_TEE_S)
#define LP_PERI_PMS_READ_TEE_LP_TEE_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_TEE_S  0
/** LP_PERI_PMS_READ_REE0_LP_TEE : HRO; bitpos: [1]; default: 0;
 *  Configures lp_tee registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_TEE    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_TEE_M  (LP_PERI_PMS_READ_REE0_LP_TEE_V << LP_PERI_PMS_READ_REE0_LP_TEE_S)
#define LP_PERI_PMS_READ_REE0_LP_TEE_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_TEE_S  1
/** LP_PERI_PMS_READ_REE1_LP_TEE : HRO; bitpos: [2]; default: 0;
 *  Configures lp_tee registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_TEE    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_TEE_M  (LP_PERI_PMS_READ_REE1_LP_TEE_V << LP_PERI_PMS_READ_REE1_LP_TEE_S)
#define LP_PERI_PMS_READ_REE1_LP_TEE_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_TEE_S  2
/** LP_PERI_PMS_READ_REE2_LP_TEE : HRO; bitpos: [3]; default: 0;
 *  Configures lp_tee registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_TEE    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_TEE_M  (LP_PERI_PMS_READ_REE2_LP_TEE_V << LP_PERI_PMS_READ_REE2_LP_TEE_S)
#define LP_PERI_PMS_READ_REE2_LP_TEE_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_TEE_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_TEE : R/W; bitpos: [4]; default: 1;
 *  Configures lp_tee registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_TEE    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_TEE_M  (LP_PERI_PMS_WRITE_TEE_LP_TEE_V << LP_PERI_PMS_WRITE_TEE_LP_TEE_S)
#define LP_PERI_PMS_WRITE_TEE_LP_TEE_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_TEE_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_TEE : HRO; bitpos: [5]; default: 0;
 *  Configures lp_tee registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_TEE    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_TEE_M  (LP_PERI_PMS_WRITE_REE0_LP_TEE_V << LP_PERI_PMS_WRITE_REE0_LP_TEE_S)
#define LP_PERI_PMS_WRITE_REE0_LP_TEE_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_TEE_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_TEE : HRO; bitpos: [6]; default: 0;
 *  Configures lp_tee registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_TEE    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_TEE_M  (LP_PERI_PMS_WRITE_REE1_LP_TEE_V << LP_PERI_PMS_WRITE_REE1_LP_TEE_S)
#define LP_PERI_PMS_WRITE_REE1_LP_TEE_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_TEE_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_TEE : HRO; bitpos: [7]; default: 0;
 *  Configures lp_tee registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_TEE    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_TEE_M  (LP_PERI_PMS_WRITE_REE2_LP_TEE_V << LP_PERI_PMS_WRITE_REE2_LP_TEE_S)
#define LP_PERI_PMS_WRITE_REE2_LP_TEE_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_TEE_S  7
/** LP_PERI_PMS_LP_TEE_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_tee peri_apm configuration
 */
#define LP_PERI_PMS_LP_TEE_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_TEE_LOCK_M  (LP_PERI_PMS_LP_TEE_LOCK_V << LP_PERI_PMS_LP_TEE_LOCK_S)
#define LP_PERI_PMS_LP_TEE_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_TEE_LOCK_S  8

/** LP_PERI_PMS_LP_APM_CTRL_REG register
 *  lp_apm read/write control register
 */
#define LP_PERI_PMS_LP_APM_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0x20)
/** LP_PERI_PMS_READ_TEE_LP_APM : R/W; bitpos: [0]; default: 1;
 *  Configures lp_apm registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_APM    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_APM_M  (LP_PERI_PMS_READ_TEE_LP_APM_V << LP_PERI_PMS_READ_TEE_LP_APM_S)
#define LP_PERI_PMS_READ_TEE_LP_APM_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_APM_S  0
/** LP_PERI_PMS_READ_REE0_LP_APM : HRO; bitpos: [1]; default: 0;
 *  Configures lp_apm registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_APM    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_APM_M  (LP_PERI_PMS_READ_REE0_LP_APM_V << LP_PERI_PMS_READ_REE0_LP_APM_S)
#define LP_PERI_PMS_READ_REE0_LP_APM_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_APM_S  1
/** LP_PERI_PMS_READ_REE1_LP_APM : HRO; bitpos: [2]; default: 0;
 *  Configures lp_apm registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_APM    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_APM_M  (LP_PERI_PMS_READ_REE1_LP_APM_V << LP_PERI_PMS_READ_REE1_LP_APM_S)
#define LP_PERI_PMS_READ_REE1_LP_APM_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_APM_S  2
/** LP_PERI_PMS_READ_REE2_LP_APM : HRO; bitpos: [3]; default: 0;
 *  Configures lp_apm registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_APM    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_APM_M  (LP_PERI_PMS_READ_REE2_LP_APM_V << LP_PERI_PMS_READ_REE2_LP_APM_S)
#define LP_PERI_PMS_READ_REE2_LP_APM_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_APM_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_APM : R/W; bitpos: [4]; default: 1;
 *  Configures lp_apm registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_APM    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_APM_M  (LP_PERI_PMS_WRITE_TEE_LP_APM_V << LP_PERI_PMS_WRITE_TEE_LP_APM_S)
#define LP_PERI_PMS_WRITE_TEE_LP_APM_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_APM_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_APM : HRO; bitpos: [5]; default: 0;
 *  Configures lp_apm registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_APM    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_APM_M  (LP_PERI_PMS_WRITE_REE0_LP_APM_V << LP_PERI_PMS_WRITE_REE0_LP_APM_S)
#define LP_PERI_PMS_WRITE_REE0_LP_APM_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_APM_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_APM : HRO; bitpos: [6]; default: 0;
 *  Configures lp_apm registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_APM    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_APM_M  (LP_PERI_PMS_WRITE_REE1_LP_APM_V << LP_PERI_PMS_WRITE_REE1_LP_APM_S)
#define LP_PERI_PMS_WRITE_REE1_LP_APM_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_APM_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_APM : HRO; bitpos: [7]; default: 0;
 *  Configures lp_apm registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_APM    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_APM_M  (LP_PERI_PMS_WRITE_REE2_LP_APM_V << LP_PERI_PMS_WRITE_REE2_LP_APM_S)
#define LP_PERI_PMS_WRITE_REE2_LP_APM_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_APM_S  7
/** LP_PERI_PMS_LP_APM_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_apm peri_apm configuration
 */
#define LP_PERI_PMS_LP_APM_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_APM_LOCK_M  (LP_PERI_PMS_LP_APM_LOCK_V << LP_PERI_PMS_LP_APM_LOCK_S)
#define LP_PERI_PMS_LP_APM_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_APM_LOCK_S  8

/** LP_PERI_PMS_LP_TIMER_CTRL_REG register
 *  lp_timer read/write control register
 */
#define LP_PERI_PMS_LP_TIMER_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0x24)
/** LP_PERI_PMS_READ_TEE_LP_TIMER : R/W; bitpos: [0]; default: 1;
 *  Configures lp_timer registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_TIMER    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_TIMER_M  (LP_PERI_PMS_READ_TEE_LP_TIMER_V << LP_PERI_PMS_READ_TEE_LP_TIMER_S)
#define LP_PERI_PMS_READ_TEE_LP_TIMER_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_TIMER_S  0
/** LP_PERI_PMS_READ_REE0_LP_TIMER : R/W; bitpos: [1]; default: 0;
 *  Configures lp_timer registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_TIMER    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_TIMER_M  (LP_PERI_PMS_READ_REE0_LP_TIMER_V << LP_PERI_PMS_READ_REE0_LP_TIMER_S)
#define LP_PERI_PMS_READ_REE0_LP_TIMER_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_TIMER_S  1
/** LP_PERI_PMS_READ_REE1_LP_TIMER : R/W; bitpos: [2]; default: 0;
 *  Configures lp_timer registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_TIMER    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_TIMER_M  (LP_PERI_PMS_READ_REE1_LP_TIMER_V << LP_PERI_PMS_READ_REE1_LP_TIMER_S)
#define LP_PERI_PMS_READ_REE1_LP_TIMER_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_TIMER_S  2
/** LP_PERI_PMS_READ_REE2_LP_TIMER : R/W; bitpos: [3]; default: 0;
 *  Configures lp_timer registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_TIMER    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_TIMER_M  (LP_PERI_PMS_READ_REE2_LP_TIMER_V << LP_PERI_PMS_READ_REE2_LP_TIMER_S)
#define LP_PERI_PMS_READ_REE2_LP_TIMER_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_TIMER_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_TIMER : R/W; bitpos: [4]; default: 1;
 *  Configures lp_timer registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_TIMER    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_TIMER_M  (LP_PERI_PMS_WRITE_TEE_LP_TIMER_V << LP_PERI_PMS_WRITE_TEE_LP_TIMER_S)
#define LP_PERI_PMS_WRITE_TEE_LP_TIMER_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_TIMER_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_TIMER : R/W; bitpos: [5]; default: 0;
 *  Configures lp_timer registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_TIMER    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_TIMER_M  (LP_PERI_PMS_WRITE_REE0_LP_TIMER_V << LP_PERI_PMS_WRITE_REE0_LP_TIMER_S)
#define LP_PERI_PMS_WRITE_REE0_LP_TIMER_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_TIMER_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_TIMER : R/W; bitpos: [6]; default: 0;
 *  Configures lp_timer registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_TIMER    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_TIMER_M  (LP_PERI_PMS_WRITE_REE1_LP_TIMER_V << LP_PERI_PMS_WRITE_REE1_LP_TIMER_S)
#define LP_PERI_PMS_WRITE_REE1_LP_TIMER_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_TIMER_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_TIMER : R/W; bitpos: [7]; default: 0;
 *  Configures lp_timer registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_TIMER    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_TIMER_M  (LP_PERI_PMS_WRITE_REE2_LP_TIMER_V << LP_PERI_PMS_WRITE_REE2_LP_TIMER_S)
#define LP_PERI_PMS_WRITE_REE2_LP_TIMER_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_TIMER_S  7
/** LP_PERI_PMS_LP_TIMER_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_timer peri_apm configuration
 */
#define LP_PERI_PMS_LP_TIMER_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_TIMER_LOCK_M  (LP_PERI_PMS_LP_TIMER_LOCK_V << LP_PERI_PMS_LP_TIMER_LOCK_S)
#define LP_PERI_PMS_LP_TIMER_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_TIMER_LOCK_S  8

