espressif/esp-idf/components/soc/esp32s31/register/soc/lp_peri_pms_reg.h
/** LP_PERI_PMS_LP_WDT_CTRL_REG register
 *  lp_wdt read/write control register
 */
#define LP_PERI_PMS_LP_WDT_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0x28)
/** LP_PERI_PMS_READ_TEE_LP_WDT : R/W; bitpos: [0]; default: 1;
 *  Configures lp_wdt registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_WDT    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_WDT_M  (LP_PERI_PMS_READ_TEE_LP_WDT_V << LP_PERI_PMS_READ_TEE_LP_WDT_S)
#define LP_PERI_PMS_READ_TEE_LP_WDT_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_WDT_S  0
/** LP_PERI_PMS_READ_REE0_LP_WDT : R/W; bitpos: [1]; default: 0;
 *  Configures lp_wdt registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_WDT    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_WDT_M  (LP_PERI_PMS_READ_REE0_LP_WDT_V << LP_PERI_PMS_READ_REE0_LP_WDT_S)
#define LP_PERI_PMS_READ_REE0_LP_WDT_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_WDT_S  1
/** LP_PERI_PMS_READ_REE1_LP_WDT : R/W; bitpos: [2]; default: 0;
 *  Configures lp_wdt registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_WDT    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_WDT_M  (LP_PERI_PMS_READ_REE1_LP_WDT_V << LP_PERI_PMS_READ_REE1_LP_WDT_S)
#define LP_PERI_PMS_READ_REE1_LP_WDT_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_WDT_S  2
/** LP_PERI_PMS_READ_REE2_LP_WDT : R/W; bitpos: [3]; default: 0;
 *  Configures lp_wdt registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_WDT    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_WDT_M  (LP_PERI_PMS_READ_REE2_LP_WDT_V << LP_PERI_PMS_READ_REE2_LP_WDT_S)
#define LP_PERI_PMS_READ_REE2_LP_WDT_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_WDT_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_WDT : R/W; bitpos: [4]; default: 1;
 *  Configures lp_wdt registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_WDT    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_WDT_M  (LP_PERI_PMS_WRITE_TEE_LP_WDT_V << LP_PERI_PMS_WRITE_TEE_LP_WDT_S)
#define LP_PERI_PMS_WRITE_TEE_LP_WDT_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_WDT_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_WDT : R/W; bitpos: [5]; default: 0;
 *  Configures lp_wdt registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_WDT    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_WDT_M  (LP_PERI_PMS_WRITE_REE0_LP_WDT_V << LP_PERI_PMS_WRITE_REE0_LP_WDT_S)
#define LP_PERI_PMS_WRITE_REE0_LP_WDT_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_WDT_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_WDT : R/W; bitpos: [6]; default: 0;
 *  Configures lp_wdt registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_WDT    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_WDT_M  (LP_PERI_PMS_WRITE_REE1_LP_WDT_V << LP_PERI_PMS_WRITE_REE1_LP_WDT_S)
#define LP_PERI_PMS_WRITE_REE1_LP_WDT_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_WDT_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_WDT : R/W; bitpos: [7]; default: 0;
 *  Configures lp_wdt registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_WDT    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_WDT_M  (LP_PERI_PMS_WRITE_REE2_LP_WDT_V << LP_PERI_PMS_WRITE_REE2_LP_WDT_S)
#define LP_PERI_PMS_WRITE_REE2_LP_WDT_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_WDT_S  7
/** LP_PERI_PMS_LP_WDT_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_wdt peri_apm configuration
 */
#define LP_PERI_PMS_LP_WDT_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_WDT_LOCK_M  (LP_PERI_PMS_LP_WDT_LOCK_V << LP_PERI_PMS_LP_WDT_LOCK_S)
#define LP_PERI_PMS_LP_WDT_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_WDT_LOCK_S  8

/** LP_PERI_PMS_LP_CLK_CALI_SOSC_CTRL_REG register
 *  lp_clk_cali_sosc read/write control register
 */
#define LP_PERI_PMS_LP_CLK_CALI_SOSC_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0x2c)
/** LP_PERI_PMS_READ_TEE_LP_CLK_CALI_SOSC : R/W; bitpos: [0]; default: 1;
 *  Configures lp_clk_cali_sosc registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_CLK_CALI_SOSC    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_CLK_CALI_SOSC_M  (LP_PERI_PMS_READ_TEE_LP_CLK_CALI_SOSC_V << LP_PERI_PMS_READ_TEE_LP_CLK_CALI_SOSC_S)
#define LP_PERI_PMS_READ_TEE_LP_CLK_CALI_SOSC_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_CLK_CALI_SOSC_S  0
/** LP_PERI_PMS_READ_REE0_LP_CLK_CALI_SOSC : R/W; bitpos: [1]; default: 0;
 *  Configures lp_clk_cali_sosc registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_CLK_CALI_SOSC    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_CLK_CALI_SOSC_M  (LP_PERI_PMS_READ_REE0_LP_CLK_CALI_SOSC_V << LP_PERI_PMS_READ_REE0_LP_CLK_CALI_SOSC_S)
#define LP_PERI_PMS_READ_REE0_LP_CLK_CALI_SOSC_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_CLK_CALI_SOSC_S  1
/** LP_PERI_PMS_READ_REE1_LP_CLK_CALI_SOSC : R/W; bitpos: [2]; default: 0;
 *  Configures lp_clk_cali_sosc registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_CLK_CALI_SOSC    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_CLK_CALI_SOSC_M  (LP_PERI_PMS_READ_REE1_LP_CLK_CALI_SOSC_V << LP_PERI_PMS_READ_REE1_LP_CLK_CALI_SOSC_S)
#define LP_PERI_PMS_READ_REE1_LP_CLK_CALI_SOSC_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_CLK_CALI_SOSC_S  2
/** LP_PERI_PMS_READ_REE2_LP_CLK_CALI_SOSC : R/W; bitpos: [3]; default: 0;
 *  Configures lp_clk_cali_sosc registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_CLK_CALI_SOSC    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_CLK_CALI_SOSC_M  (LP_PERI_PMS_READ_REE2_LP_CLK_CALI_SOSC_V << LP_PERI_PMS_READ_REE2_LP_CLK_CALI_SOSC_S)
#define LP_PERI_PMS_READ_REE2_LP_CLK_CALI_SOSC_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_CLK_CALI_SOSC_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_CLK_CALI_SOSC : R/W; bitpos: [4]; default: 1;
 *  Configures lp_clk_cali_sosc registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_CLK_CALI_SOSC    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_CLK_CALI_SOSC_M  (LP_PERI_PMS_WRITE_TEE_LP_CLK_CALI_SOSC_V << LP_PERI_PMS_WRITE_TEE_LP_CLK_CALI_SOSC_S)
#define LP_PERI_PMS_WRITE_TEE_LP_CLK_CALI_SOSC_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_CLK_CALI_SOSC_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_CLK_CALI_SOSC : R/W; bitpos: [5]; default: 0;
 *  Configures lp_clk_cali_sosc registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_CLK_CALI_SOSC    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_CLK_CALI_SOSC_M  (LP_PERI_PMS_WRITE_REE0_LP_CLK_CALI_SOSC_V << LP_PERI_PMS_WRITE_REE0_LP_CLK_CALI_SOSC_S)
#define LP_PERI_PMS_WRITE_REE0_LP_CLK_CALI_SOSC_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_CLK_CALI_SOSC_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_CLK_CALI_SOSC : R/W; bitpos: [6]; default: 0;
 *  Configures lp_clk_cali_sosc registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_CLK_CALI_SOSC    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_CLK_CALI_SOSC_M  (LP_PERI_PMS_WRITE_REE1_LP_CLK_CALI_SOSC_V << LP_PERI_PMS_WRITE_REE1_LP_CLK_CALI_SOSC_S)
#define LP_PERI_PMS_WRITE_REE1_LP_CLK_CALI_SOSC_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_CLK_CALI_SOSC_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_CLK_CALI_SOSC : R/W; bitpos: [7]; default: 0;
 *  Configures lp_clk_cali_sosc registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_CLK_CALI_SOSC    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_CLK_CALI_SOSC_M  (LP_PERI_PMS_WRITE_REE2_LP_CLK_CALI_SOSC_V << LP_PERI_PMS_WRITE_REE2_LP_CLK_CALI_SOSC_S)
#define LP_PERI_PMS_WRITE_REE2_LP_CLK_CALI_SOSC_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_CLK_CALI_SOSC_S  7
/** LP_PERI_PMS_LP_CLK_CALI_SOSC_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_clk_cali_sosc peri_apm configuration
 */
#define LP_PERI_PMS_LP_CLK_CALI_SOSC_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_CLK_CALI_SOSC_LOCK_M  (LP_PERI_PMS_LP_CLK_CALI_SOSC_LOCK_V << LP_PERI_PMS_LP_CLK_CALI_SOSC_LOCK_S)
#define LP_PERI_PMS_LP_CLK_CALI_SOSC_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_CLK_CALI_SOSC_LOCK_S  8

