espressif/esp-idf/components/soc/esp32s31/register/soc/lp_peri_pms_reg.h
/** LP_PERI_PMS_LP_CLK_CALI_FOSC_CTRL_REG register
 *  lp_clk_cali_fosc read/write control register
 */
#define LP_PERI_PMS_LP_CLK_CALI_FOSC_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0x30)
/** LP_PERI_PMS_READ_TEE_LP_CLK_CALI_FOSC : R/W; bitpos: [0]; default: 1;
 *  Configures lp_clk_cali_fosc registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_CLK_CALI_FOSC    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_CLK_CALI_FOSC_M  (LP_PERI_PMS_READ_TEE_LP_CLK_CALI_FOSC_V << LP_PERI_PMS_READ_TEE_LP_CLK_CALI_FOSC_S)
#define LP_PERI_PMS_READ_TEE_LP_CLK_CALI_FOSC_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_CLK_CALI_FOSC_S  0
/** LP_PERI_PMS_READ_REE0_LP_CLK_CALI_FOSC : R/W; bitpos: [1]; default: 0;
 *  Configures lp_clk_cali_fosc registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_CLK_CALI_FOSC    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_CLK_CALI_FOSC_M  (LP_PERI_PMS_READ_REE0_LP_CLK_CALI_FOSC_V << LP_PERI_PMS_READ_REE0_LP_CLK_CALI_FOSC_S)
#define LP_PERI_PMS_READ_REE0_LP_CLK_CALI_FOSC_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_CLK_CALI_FOSC_S  1
/** LP_PERI_PMS_READ_REE1_LP_CLK_CALI_FOSC : R/W; bitpos: [2]; default: 0;
 *  Configures lp_clk_cali_fosc registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_CLK_CALI_FOSC    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_CLK_CALI_FOSC_M  (LP_PERI_PMS_READ_REE1_LP_CLK_CALI_FOSC_V << LP_PERI_PMS_READ_REE1_LP_CLK_CALI_FOSC_S)
#define LP_PERI_PMS_READ_REE1_LP_CLK_CALI_FOSC_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_CLK_CALI_FOSC_S  2
/** LP_PERI_PMS_READ_REE2_LP_CLK_CALI_FOSC : R/W; bitpos: [3]; default: 0;
 *  Configures lp_clk_cali_fosc registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_CLK_CALI_FOSC    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_CLK_CALI_FOSC_M  (LP_PERI_PMS_READ_REE2_LP_CLK_CALI_FOSC_V << LP_PERI_PMS_READ_REE2_LP_CLK_CALI_FOSC_S)
#define LP_PERI_PMS_READ_REE2_LP_CLK_CALI_FOSC_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_CLK_CALI_FOSC_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_CLK_CALI_FOSC : R/W; bitpos: [4]; default: 1;
 *  Configures lp_clk_cali_fosc registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_CLK_CALI_FOSC    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_CLK_CALI_FOSC_M  (LP_PERI_PMS_WRITE_TEE_LP_CLK_CALI_FOSC_V << LP_PERI_PMS_WRITE_TEE_LP_CLK_CALI_FOSC_S)
#define LP_PERI_PMS_WRITE_TEE_LP_CLK_CALI_FOSC_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_CLK_CALI_FOSC_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_CLK_CALI_FOSC : R/W; bitpos: [5]; default: 0;
 *  Configures lp_clk_cali_fosc registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_CLK_CALI_FOSC    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_CLK_CALI_FOSC_M  (LP_PERI_PMS_WRITE_REE0_LP_CLK_CALI_FOSC_V << LP_PERI_PMS_WRITE_REE0_LP_CLK_CALI_FOSC_S)
#define LP_PERI_PMS_WRITE_REE0_LP_CLK_CALI_FOSC_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_CLK_CALI_FOSC_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_CLK_CALI_FOSC : R/W; bitpos: [6]; default: 0;
 *  Configures lp_clk_cali_fosc registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_CLK_CALI_FOSC    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_CLK_CALI_FOSC_M  (LP_PERI_PMS_WRITE_REE1_LP_CLK_CALI_FOSC_V << LP_PERI_PMS_WRITE_REE1_LP_CLK_CALI_FOSC_S)
#define LP_PERI_PMS_WRITE_REE1_LP_CLK_CALI_FOSC_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_CLK_CALI_FOSC_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_CLK_CALI_FOSC : R/W; bitpos: [7]; default: 0;
 *  Configures lp_clk_cali_fosc registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_CLK_CALI_FOSC    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_CLK_CALI_FOSC_M  (LP_PERI_PMS_WRITE_REE2_LP_CLK_CALI_FOSC_V << LP_PERI_PMS_WRITE_REE2_LP_CLK_CALI_FOSC_S)
#define LP_PERI_PMS_WRITE_REE2_LP_CLK_CALI_FOSC_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_CLK_CALI_FOSC_S  7
/** LP_PERI_PMS_LP_CLK_CALI_FOSC_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_clk_cali_fosc peri_apm configuration
 */
#define LP_PERI_PMS_LP_CLK_CALI_FOSC_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_CLK_CALI_FOSC_LOCK_M  (LP_PERI_PMS_LP_CLK_CALI_FOSC_LOCK_V << LP_PERI_PMS_LP_CLK_CALI_FOSC_LOCK_S)
#define LP_PERI_PMS_LP_CLK_CALI_FOSC_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_CLK_CALI_FOSC_LOCK_S  8

/** LP_PERI_PMS_LP_PWR_REG_CTRL_REG register
 *  lp_pwr_reg read/write control register
 */
#define LP_PERI_PMS_LP_PWR_REG_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0x34)
/** LP_PERI_PMS_READ_TEE_LP_PWR_REG : R/W; bitpos: [0]; default: 1;
 *  Configures lp_pwr_reg registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_PWR_REG    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_PWR_REG_M  (LP_PERI_PMS_READ_TEE_LP_PWR_REG_V << LP_PERI_PMS_READ_TEE_LP_PWR_REG_S)
#define LP_PERI_PMS_READ_TEE_LP_PWR_REG_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_PWR_REG_S  0
/** LP_PERI_PMS_READ_REE0_LP_PWR_REG : R/W; bitpos: [1]; default: 0;
 *  Configures lp_pwr_reg registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_PWR_REG    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_PWR_REG_M  (LP_PERI_PMS_READ_REE0_LP_PWR_REG_V << LP_PERI_PMS_READ_REE0_LP_PWR_REG_S)
#define LP_PERI_PMS_READ_REE0_LP_PWR_REG_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_PWR_REG_S  1
/** LP_PERI_PMS_READ_REE1_LP_PWR_REG : R/W; bitpos: [2]; default: 0;
 *  Configures lp_pwr_reg registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_PWR_REG    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_PWR_REG_M  (LP_PERI_PMS_READ_REE1_LP_PWR_REG_V << LP_PERI_PMS_READ_REE1_LP_PWR_REG_S)
#define LP_PERI_PMS_READ_REE1_LP_PWR_REG_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_PWR_REG_S  2
/** LP_PERI_PMS_READ_REE2_LP_PWR_REG : R/W; bitpos: [3]; default: 0;
 *  Configures lp_pwr_reg registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_PWR_REG    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_PWR_REG_M  (LP_PERI_PMS_READ_REE2_LP_PWR_REG_V << LP_PERI_PMS_READ_REE2_LP_PWR_REG_S)
#define LP_PERI_PMS_READ_REE2_LP_PWR_REG_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_PWR_REG_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_PWR_REG : R/W; bitpos: [4]; default: 1;
 *  Configures lp_pwr_reg registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_PWR_REG    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_PWR_REG_M  (LP_PERI_PMS_WRITE_TEE_LP_PWR_REG_V << LP_PERI_PMS_WRITE_TEE_LP_PWR_REG_S)
#define LP_PERI_PMS_WRITE_TEE_LP_PWR_REG_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_PWR_REG_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_PWR_REG : R/W; bitpos: [5]; default: 0;
 *  Configures lp_pwr_reg registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_PWR_REG    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_PWR_REG_M  (LP_PERI_PMS_WRITE_REE0_LP_PWR_REG_V << LP_PERI_PMS_WRITE_REE0_LP_PWR_REG_S)
#define LP_PERI_PMS_WRITE_REE0_LP_PWR_REG_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_PWR_REG_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_PWR_REG : R/W; bitpos: [6]; default: 0;
 *  Configures lp_pwr_reg registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_PWR_REG    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_PWR_REG_M  (LP_PERI_PMS_WRITE_REE1_LP_PWR_REG_V << LP_PERI_PMS_WRITE_REE1_LP_PWR_REG_S)
#define LP_PERI_PMS_WRITE_REE1_LP_PWR_REG_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_PWR_REG_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_PWR_REG : R/W; bitpos: [7]; default: 0;
 *  Configures lp_pwr_reg registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_PWR_REG    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_PWR_REG_M  (LP_PERI_PMS_WRITE_REE2_LP_PWR_REG_V << LP_PERI_PMS_WRITE_REE2_LP_PWR_REG_S)
#define LP_PERI_PMS_WRITE_REE2_LP_PWR_REG_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_PWR_REG_S  7
/** LP_PERI_PMS_LP_PWR_REG_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_pwr_reg peri_apm configuration
 */
#define LP_PERI_PMS_LP_PWR_REG_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_PWR_REG_LOCK_M  (LP_PERI_PMS_LP_PWR_REG_LOCK_V << LP_PERI_PMS_LP_PWR_REG_LOCK_S)
#define LP_PERI_PMS_LP_PWR_REG_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_PWR_REG_LOCK_S  8

/** LP_PERI_PMS_LP_PERICLKRST_CTRL_REG register
 *  lp_periclkrst read/write control register
 */
#define LP_PERI_PMS_LP_PERICLKRST_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0x38)
/** LP_PERI_PMS_READ_TEE_LP_PERICLKRST : R/W; bitpos: [0]; default: 1;
 *  Configures lp_periclkrst registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_PERICLKRST    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_PERICLKRST_M  (LP_PERI_PMS_READ_TEE_LP_PERICLKRST_V << LP_PERI_PMS_READ_TEE_LP_PERICLKRST_S)
#define LP_PERI_PMS_READ_TEE_LP_PERICLKRST_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_PERICLKRST_S  0
/** LP_PERI_PMS_READ_REE0_LP_PERICLKRST : R/W; bitpos: [1]; default: 0;
 *  Configures lp_periclkrst registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_PERICLKRST    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_PERICLKRST_M  (LP_PERI_PMS_READ_REE0_LP_PERICLKRST_V << LP_PERI_PMS_READ_REE0_LP_PERICLKRST_S)
#define LP_PERI_PMS_READ_REE0_LP_PERICLKRST_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_PERICLKRST_S  1
/** LP_PERI_PMS_READ_REE1_LP_PERICLKRST : R/W; bitpos: [2]; default: 0;
 *  Configures lp_periclkrst registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_PERICLKRST    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_PERICLKRST_M  (LP_PERI_PMS_READ_REE1_LP_PERICLKRST_V << LP_PERI_PMS_READ_REE1_LP_PERICLKRST_S)
#define LP_PERI_PMS_READ_REE1_LP_PERICLKRST_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_PERICLKRST_S  2
/** LP_PERI_PMS_READ_REE2_LP_PERICLKRST : R/W; bitpos: [3]; default: 0;
 *  Configures lp_periclkrst registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_PERICLKRST    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_PERICLKRST_M  (LP_PERI_PMS_READ_REE2_LP_PERICLKRST_V << LP_PERI_PMS_READ_REE2_LP_PERICLKRST_S)
#define LP_PERI_PMS_READ_REE2_LP_PERICLKRST_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_PERICLKRST_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_PERICLKRST : R/W; bitpos: [4]; default: 1;
 *  Configures lp_periclkrst registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_PERICLKRST    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_PERICLKRST_M  (LP_PERI_PMS_WRITE_TEE_LP_PERICLKRST_V << LP_PERI_PMS_WRITE_TEE_LP_PERICLKRST_S)
#define LP_PERI_PMS_WRITE_TEE_LP_PERICLKRST_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_PERICLKRST_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_PERICLKRST : R/W; bitpos: [5]; default: 0;
 *  Configures lp_periclkrst registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_PERICLKRST    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_PERICLKRST_M  (LP_PERI_PMS_WRITE_REE0_LP_PERICLKRST_V << LP_PERI_PMS_WRITE_REE0_LP_PERICLKRST_S)
#define LP_PERI_PMS_WRITE_REE0_LP_PERICLKRST_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_PERICLKRST_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_PERICLKRST : R/W; bitpos: [6]; default: 0;
 *  Configures lp_periclkrst registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_PERICLKRST    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_PERICLKRST_M  (LP_PERI_PMS_WRITE_REE1_LP_PERICLKRST_V << LP_PERI_PMS_WRITE_REE1_LP_PERICLKRST_S)
#define LP_PERI_PMS_WRITE_REE1_LP_PERICLKRST_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_PERICLKRST_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_PERICLKRST : R/W; bitpos: [7]; default: 0;
 *  Configures lp_periclkrst registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_PERICLKRST    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_PERICLKRST_M  (LP_PERI_PMS_WRITE_REE2_LP_PERICLKRST_V << LP_PERI_PMS_WRITE_REE2_LP_PERICLKRST_S)
#define LP_PERI_PMS_WRITE_REE2_LP_PERICLKRST_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_PERICLKRST_S  7
/** LP_PERI_PMS_LP_PERICLKRST_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_periclkrst peri_apm configuration
 */
#define LP_PERI_PMS_LP_PERICLKRST_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_PERICLKRST_LOCK_M  (LP_PERI_PMS_LP_PERICLKRST_LOCK_V << LP_PERI_PMS_LP_PERICLKRST_LOCK_S)
#define LP_PERI_PMS_LP_PERICLKRST_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_PERICLKRST_LOCK_S  8

/** LP_PERI_PMS_LP_IOMUX_CTRL_REG register
 *  lp_iomux read/write control register
 */
#define LP_PERI_PMS_LP_IOMUX_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0x3c)
/** LP_PERI_PMS_READ_TEE_LP_IOMUX : R/W; bitpos: [0]; default: 1;
 *  Configures lp_iomux registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_IOMUX    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_IOMUX_M  (LP_PERI_PMS_READ_TEE_LP_IOMUX_V << LP_PERI_PMS_READ_TEE_LP_IOMUX_S)
#define LP_PERI_PMS_READ_TEE_LP_IOMUX_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_IOMUX_S  0
/** LP_PERI_PMS_READ_REE0_LP_IOMUX : R/W; bitpos: [1]; default: 0;
 *  Configures lp_iomux registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_IOMUX    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_IOMUX_M  (LP_PERI_PMS_READ_REE0_LP_IOMUX_V << LP_PERI_PMS_READ_REE0_LP_IOMUX_S)
#define LP_PERI_PMS_READ_REE0_LP_IOMUX_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_IOMUX_S  1
/** LP_PERI_PMS_READ_REE1_LP_IOMUX : R/W; bitpos: [2]; default: 0;
 *  Configures lp_iomux registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_IOMUX    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_IOMUX_M  (LP_PERI_PMS_READ_REE1_LP_IOMUX_V << LP_PERI_PMS_READ_REE1_LP_IOMUX_S)
#define LP_PERI_PMS_READ_REE1_LP_IOMUX_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_IOMUX_S  2
/** LP_PERI_PMS_READ_REE2_LP_IOMUX : R/W; bitpos: [3]; default: 0;
 *  Configures lp_iomux registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_IOMUX    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_IOMUX_M  (LP_PERI_PMS_READ_REE2_LP_IOMUX_V << LP_PERI_PMS_READ_REE2_LP_IOMUX_S)
#define LP_PERI_PMS_READ_REE2_LP_IOMUX_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_IOMUX_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_IOMUX : R/W; bitpos: [4]; default: 1;
 *  Configures lp_iomux registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_IOMUX    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_IOMUX_M  (LP_PERI_PMS_WRITE_TEE_LP_IOMUX_V << LP_PERI_PMS_WRITE_TEE_LP_IOMUX_S)
#define LP_PERI_PMS_WRITE_TEE_LP_IOMUX_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_IOMUX_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_IOMUX : R/W; bitpos: [5]; default: 0;
 *  Configures lp_iomux registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_IOMUX    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_IOMUX_M  (LP_PERI_PMS_WRITE_REE0_LP_IOMUX_V << LP_PERI_PMS_WRITE_REE0_LP_IOMUX_S)
#define LP_PERI_PMS_WRITE_REE0_LP_IOMUX_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_IOMUX_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_IOMUX : R/W; bitpos: [6]; default: 0;
 *  Configures lp_iomux registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_IOMUX    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_IOMUX_M  (LP_PERI_PMS_WRITE_REE1_LP_IOMUX_V << LP_PERI_PMS_WRITE_REE1_LP_IOMUX_S)
#define LP_PERI_PMS_WRITE_REE1_LP_IOMUX_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_IOMUX_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_IOMUX : R/W; bitpos: [7]; default: 0;
 *  Configures lp_iomux registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_IOMUX    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_IOMUX_M  (LP_PERI_PMS_WRITE_REE2_LP_IOMUX_V << LP_PERI_PMS_WRITE_REE2_LP_IOMUX_S)
#define LP_PERI_PMS_WRITE_REE2_LP_IOMUX_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_IOMUX_S  7
/** LP_PERI_PMS_LP_IOMUX_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_iomux peri_apm configuration
 */
#define LP_PERI_PMS_LP_IOMUX_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_IOMUX_LOCK_M  (LP_PERI_PMS_LP_IOMUX_LOCK_V << LP_PERI_PMS_LP_IOMUX_LOCK_S)
#define LP_PERI_PMS_LP_IOMUX_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_IOMUX_LOCK_S  8

/** LP_PERI_PMS_LP_INTR_CTRL_REG register
 *  lp_intr read/write control register
 */
#define LP_PERI_PMS_LP_INTR_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0x40)
/** LP_PERI_PMS_READ_TEE_LP_INTR : R/W; bitpos: [0]; default: 1;
 *  Configures lp_intr registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_INTR    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_INTR_M  (LP_PERI_PMS_READ_TEE_LP_INTR_V << LP_PERI_PMS_READ_TEE_LP_INTR_S)
#define LP_PERI_PMS_READ_TEE_LP_INTR_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_INTR_S  0
/** LP_PERI_PMS_READ_REE0_LP_INTR : R/W; bitpos: [1]; default: 0;
 *  Configures lp_intr registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_INTR    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_INTR_M  (LP_PERI_PMS_READ_REE0_LP_INTR_V << LP_PERI_PMS_READ_REE0_LP_INTR_S)
#define LP_PERI_PMS_READ_REE0_LP_INTR_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_INTR_S  1
/** LP_PERI_PMS_READ_REE1_LP_INTR : R/W; bitpos: [2]; default: 0;
 *  Configures lp_intr registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_INTR    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_INTR_M  (LP_PERI_PMS_READ_REE1_LP_INTR_V << LP_PERI_PMS_READ_REE1_LP_INTR_S)
#define LP_PERI_PMS_READ_REE1_LP_INTR_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_INTR_S  2
/** LP_PERI_PMS_READ_REE2_LP_INTR : R/W; bitpos: [3]; default: 0;
 *  Configures lp_intr registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_INTR    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_INTR_M  (LP_PERI_PMS_READ_REE2_LP_INTR_V << LP_PERI_PMS_READ_REE2_LP_INTR_S)
#define LP_PERI_PMS_READ_REE2_LP_INTR_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_INTR_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_INTR : R/W; bitpos: [4]; default: 1;
 *  Configures lp_intr registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_INTR    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_INTR_M  (LP_PERI_PMS_WRITE_TEE_LP_INTR_V << LP_PERI_PMS_WRITE_TEE_LP_INTR_S)
#define LP_PERI_PMS_WRITE_TEE_LP_INTR_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_INTR_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_INTR : R/W; bitpos: [5]; default: 0;
 *  Configures lp_intr registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_INTR    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_INTR_M  (LP_PERI_PMS_WRITE_REE0_LP_INTR_V << LP_PERI_PMS_WRITE_REE0_LP_INTR_S)
#define LP_PERI_PMS_WRITE_REE0_LP_INTR_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_INTR_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_INTR : R/W; bitpos: [6]; default: 0;
 *  Configures lp_intr registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_INTR    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_INTR_M  (LP_PERI_PMS_WRITE_REE1_LP_INTR_V << LP_PERI_PMS_WRITE_REE1_LP_INTR_S)
#define LP_PERI_PMS_WRITE_REE1_LP_INTR_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_INTR_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_INTR : R/W; bitpos: [7]; default: 0;
 *  Configures lp_intr registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_INTR    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_INTR_M  (LP_PERI_PMS_WRITE_REE2_LP_INTR_V << LP_PERI_PMS_WRITE_REE2_LP_INTR_S)
#define LP_PERI_PMS_WRITE_REE2_LP_INTR_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_INTR_S  7
/** LP_PERI_PMS_LP_INTR_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_intr peri_apm configuration
 */
#define LP_PERI_PMS_LP_INTR_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_INTR_LOCK_M  (LP_PERI_PMS_LP_INTR_LOCK_V << LP_PERI_PMS_LP_INTR_LOCK_S)
#define LP_PERI_PMS_LP_INTR_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_INTR_LOCK_S  8

