espressif/esp-idf/components/soc/esp32s31/register/soc/lp_peri_pms_reg.h
/** LP_PERI_PMS_LP_EFUSE_CTRL_REG register
 *  lp_efuse read/write control register
 */
#define LP_PERI_PMS_LP_EFUSE_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0x44)
/** LP_PERI_PMS_READ_TEE_LP_EFUSE : R/W; bitpos: [0]; default: 1;
 *  Configures lp_efuse registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_EFUSE    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_EFUSE_M  (LP_PERI_PMS_READ_TEE_LP_EFUSE_V << LP_PERI_PMS_READ_TEE_LP_EFUSE_S)
#define LP_PERI_PMS_READ_TEE_LP_EFUSE_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_EFUSE_S  0
/** LP_PERI_PMS_READ_REE0_LP_EFUSE : R/W; bitpos: [1]; default: 0;
 *  Configures lp_efuse registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_EFUSE    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_EFUSE_M  (LP_PERI_PMS_READ_REE0_LP_EFUSE_V << LP_PERI_PMS_READ_REE0_LP_EFUSE_S)
#define LP_PERI_PMS_READ_REE0_LP_EFUSE_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_EFUSE_S  1
/** LP_PERI_PMS_READ_REE1_LP_EFUSE : R/W; bitpos: [2]; default: 0;
 *  Configures lp_efuse registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_EFUSE    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_EFUSE_M  (LP_PERI_PMS_READ_REE1_LP_EFUSE_V << LP_PERI_PMS_READ_REE1_LP_EFUSE_S)
#define LP_PERI_PMS_READ_REE1_LP_EFUSE_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_EFUSE_S  2
/** LP_PERI_PMS_READ_REE2_LP_EFUSE : R/W; bitpos: [3]; default: 0;
 *  Configures lp_efuse registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_EFUSE    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_EFUSE_M  (LP_PERI_PMS_READ_REE2_LP_EFUSE_V << LP_PERI_PMS_READ_REE2_LP_EFUSE_S)
#define LP_PERI_PMS_READ_REE2_LP_EFUSE_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_EFUSE_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_EFUSE : R/W; bitpos: [4]; default: 1;
 *  Configures lp_efuse registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_EFUSE    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_EFUSE_M  (LP_PERI_PMS_WRITE_TEE_LP_EFUSE_V << LP_PERI_PMS_WRITE_TEE_LP_EFUSE_S)
#define LP_PERI_PMS_WRITE_TEE_LP_EFUSE_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_EFUSE_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_EFUSE : R/W; bitpos: [5]; default: 0;
 *  Configures lp_efuse registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_EFUSE    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_EFUSE_M  (LP_PERI_PMS_WRITE_REE0_LP_EFUSE_V << LP_PERI_PMS_WRITE_REE0_LP_EFUSE_S)
#define LP_PERI_PMS_WRITE_REE0_LP_EFUSE_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_EFUSE_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_EFUSE : R/W; bitpos: [6]; default: 0;
 *  Configures lp_efuse registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_EFUSE    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_EFUSE_M  (LP_PERI_PMS_WRITE_REE1_LP_EFUSE_V << LP_PERI_PMS_WRITE_REE1_LP_EFUSE_S)
#define LP_PERI_PMS_WRITE_REE1_LP_EFUSE_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_EFUSE_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_EFUSE : R/W; bitpos: [7]; default: 0;
 *  Configures lp_efuse registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_EFUSE    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_EFUSE_M  (LP_PERI_PMS_WRITE_REE2_LP_EFUSE_V << LP_PERI_PMS_WRITE_REE2_LP_EFUSE_S)
#define LP_PERI_PMS_WRITE_REE2_LP_EFUSE_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_EFUSE_S  7
/** LP_PERI_PMS_LP_EFUSE_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_efuse peri_apm configuration
 */
#define LP_PERI_PMS_LP_EFUSE_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_EFUSE_LOCK_M  (LP_PERI_PMS_LP_EFUSE_LOCK_V << LP_PERI_PMS_LP_EFUSE_LOCK_S)
#define LP_PERI_PMS_LP_EFUSE_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_EFUSE_LOCK_S  8

/** LP_PERI_PMS_LP_UART_CTRL_REG register
 *  lp_uart read/write control register
 */
#define LP_PERI_PMS_LP_UART_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0x48)
/** LP_PERI_PMS_READ_TEE_LP_UART : R/W; bitpos: [0]; default: 1;
 *  Configures lp_uart registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_UART    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_UART_M  (LP_PERI_PMS_READ_TEE_LP_UART_V << LP_PERI_PMS_READ_TEE_LP_UART_S)
#define LP_PERI_PMS_READ_TEE_LP_UART_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_UART_S  0
/** LP_PERI_PMS_READ_REE0_LP_UART : R/W; bitpos: [1]; default: 0;
 *  Configures lp_uart registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_UART    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_UART_M  (LP_PERI_PMS_READ_REE0_LP_UART_V << LP_PERI_PMS_READ_REE0_LP_UART_S)
#define LP_PERI_PMS_READ_REE0_LP_UART_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_UART_S  1
/** LP_PERI_PMS_READ_REE1_LP_UART : R/W; bitpos: [2]; default: 0;
 *  Configures lp_uart registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_UART    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_UART_M  (LP_PERI_PMS_READ_REE1_LP_UART_V << LP_PERI_PMS_READ_REE1_LP_UART_S)
#define LP_PERI_PMS_READ_REE1_LP_UART_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_UART_S  2
/** LP_PERI_PMS_READ_REE2_LP_UART : R/W; bitpos: [3]; default: 0;
 *  Configures lp_uart registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_UART    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_UART_M  (LP_PERI_PMS_READ_REE2_LP_UART_V << LP_PERI_PMS_READ_REE2_LP_UART_S)
#define LP_PERI_PMS_READ_REE2_LP_UART_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_UART_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_UART : R/W; bitpos: [4]; default: 1;
 *  Configures lp_uart registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_UART    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_UART_M  (LP_PERI_PMS_WRITE_TEE_LP_UART_V << LP_PERI_PMS_WRITE_TEE_LP_UART_S)
#define LP_PERI_PMS_WRITE_TEE_LP_UART_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_UART_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_UART : R/W; bitpos: [5]; default: 0;
 *  Configures lp_uart registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_UART    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_UART_M  (LP_PERI_PMS_WRITE_REE0_LP_UART_V << LP_PERI_PMS_WRITE_REE0_LP_UART_S)
#define LP_PERI_PMS_WRITE_REE0_LP_UART_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_UART_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_UART : R/W; bitpos: [6]; default: 0;
 *  Configures lp_uart registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_UART    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_UART_M  (LP_PERI_PMS_WRITE_REE1_LP_UART_V << LP_PERI_PMS_WRITE_REE1_LP_UART_S)
#define LP_PERI_PMS_WRITE_REE1_LP_UART_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_UART_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_UART : R/W; bitpos: [7]; default: 0;
 *  Configures lp_uart registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_UART    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_UART_M  (LP_PERI_PMS_WRITE_REE2_LP_UART_V << LP_PERI_PMS_WRITE_REE2_LP_UART_S)
#define LP_PERI_PMS_WRITE_REE2_LP_UART_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_UART_S  7
/** LP_PERI_PMS_LP_UART_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_uart peri_apm configuration
 */
#define LP_PERI_PMS_LP_UART_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_UART_LOCK_M  (LP_PERI_PMS_LP_UART_LOCK_V << LP_PERI_PMS_LP_UART_LOCK_S)
#define LP_PERI_PMS_LP_UART_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_UART_LOCK_S  8

/** LP_PERI_PMS_LP_I2C_CTRL_REG register
 *  lp_i2c read/write control register
 */
#define LP_PERI_PMS_LP_I2C_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0x4c)
/** LP_PERI_PMS_READ_TEE_LP_I2C : R/W; bitpos: [0]; default: 1;
 *  Configures lp_i2c registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_I2C    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_I2C_M  (LP_PERI_PMS_READ_TEE_LP_I2C_V << LP_PERI_PMS_READ_TEE_LP_I2C_S)
#define LP_PERI_PMS_READ_TEE_LP_I2C_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_I2C_S  0
/** LP_PERI_PMS_READ_REE0_LP_I2C : R/W; bitpos: [1]; default: 0;
 *  Configures lp_i2c registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_I2C    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_I2C_M  (LP_PERI_PMS_READ_REE0_LP_I2C_V << LP_PERI_PMS_READ_REE0_LP_I2C_S)
#define LP_PERI_PMS_READ_REE0_LP_I2C_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_I2C_S  1
/** LP_PERI_PMS_READ_REE1_LP_I2C : R/W; bitpos: [2]; default: 0;
 *  Configures lp_i2c registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_I2C    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_I2C_M  (LP_PERI_PMS_READ_REE1_LP_I2C_V << LP_PERI_PMS_READ_REE1_LP_I2C_S)
#define LP_PERI_PMS_READ_REE1_LP_I2C_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_I2C_S  2
/** LP_PERI_PMS_READ_REE2_LP_I2C : R/W; bitpos: [3]; default: 0;
 *  Configures lp_i2c registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_I2C    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_I2C_M  (LP_PERI_PMS_READ_REE2_LP_I2C_V << LP_PERI_PMS_READ_REE2_LP_I2C_S)
#define LP_PERI_PMS_READ_REE2_LP_I2C_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_I2C_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_I2C : R/W; bitpos: [4]; default: 1;
 *  Configures lp_i2c registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_I2C    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_I2C_M  (LP_PERI_PMS_WRITE_TEE_LP_I2C_V << LP_PERI_PMS_WRITE_TEE_LP_I2C_S)
#define LP_PERI_PMS_WRITE_TEE_LP_I2C_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_I2C_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_I2C : R/W; bitpos: [5]; default: 0;
 *  Configures lp_i2c registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_I2C    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_I2C_M  (LP_PERI_PMS_WRITE_REE0_LP_I2C_V << LP_PERI_PMS_WRITE_REE0_LP_I2C_S)
#define LP_PERI_PMS_WRITE_REE0_LP_I2C_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_I2C_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_I2C : R/W; bitpos: [6]; default: 0;
 *  Configures lp_i2c registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_I2C    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_I2C_M  (LP_PERI_PMS_WRITE_REE1_LP_I2C_V << LP_PERI_PMS_WRITE_REE1_LP_I2C_S)
#define LP_PERI_PMS_WRITE_REE1_LP_I2C_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_I2C_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_I2C : R/W; bitpos: [7]; default: 0;
 *  Configures lp_i2c registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_I2C    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_I2C_M  (LP_PERI_PMS_WRITE_REE2_LP_I2C_V << LP_PERI_PMS_WRITE_REE2_LP_I2C_S)
#define LP_PERI_PMS_WRITE_REE2_LP_I2C_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_I2C_S  7
/** LP_PERI_PMS_LP_I2C_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_i2c peri_apm configuration
 */
#define LP_PERI_PMS_LP_I2C_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_I2C_LOCK_M  (LP_PERI_PMS_LP_I2C_LOCK_V << LP_PERI_PMS_LP_I2C_LOCK_S)
#define LP_PERI_PMS_LP_I2C_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_I2C_LOCK_S  8

