espressif/esp-idf/components/soc/esp32s31/register/soc/lp_peri_pms_reg.h
/** LP_PERI_PMS_LP_SPI_CTRL_REG register
 *  lp_spi read/write control register
 */
#define LP_PERI_PMS_LP_SPI_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0x50)
/** LP_PERI_PMS_READ_TEE_LP_SPI : R/W; bitpos: [0]; default: 1;
 *  Configures lp_spi registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_SPI    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_SPI_M  (LP_PERI_PMS_READ_TEE_LP_SPI_V << LP_PERI_PMS_READ_TEE_LP_SPI_S)
#define LP_PERI_PMS_READ_TEE_LP_SPI_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_SPI_S  0
/** LP_PERI_PMS_READ_REE0_LP_SPI : R/W; bitpos: [1]; default: 0;
 *  Configures lp_spi registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_SPI    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_SPI_M  (LP_PERI_PMS_READ_REE0_LP_SPI_V << LP_PERI_PMS_READ_REE0_LP_SPI_S)
#define LP_PERI_PMS_READ_REE0_LP_SPI_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_SPI_S  1
/** LP_PERI_PMS_READ_REE1_LP_SPI : R/W; bitpos: [2]; default: 0;
 *  Configures lp_spi registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_SPI    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_SPI_M  (LP_PERI_PMS_READ_REE1_LP_SPI_V << LP_PERI_PMS_READ_REE1_LP_SPI_S)
#define LP_PERI_PMS_READ_REE1_LP_SPI_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_SPI_S  2
/** LP_PERI_PMS_READ_REE2_LP_SPI : R/W; bitpos: [3]; default: 0;
 *  Configures lp_spi registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_SPI    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_SPI_M  (LP_PERI_PMS_READ_REE2_LP_SPI_V << LP_PERI_PMS_READ_REE2_LP_SPI_S)
#define LP_PERI_PMS_READ_REE2_LP_SPI_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_SPI_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_SPI : R/W; bitpos: [4]; default: 1;
 *  Configures lp_spi registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_SPI    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_SPI_M  (LP_PERI_PMS_WRITE_TEE_LP_SPI_V << LP_PERI_PMS_WRITE_TEE_LP_SPI_S)
#define LP_PERI_PMS_WRITE_TEE_LP_SPI_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_SPI_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_SPI : R/W; bitpos: [5]; default: 0;
 *  Configures lp_spi registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_SPI    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_SPI_M  (LP_PERI_PMS_WRITE_REE0_LP_SPI_V << LP_PERI_PMS_WRITE_REE0_LP_SPI_S)
#define LP_PERI_PMS_WRITE_REE0_LP_SPI_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_SPI_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_SPI : R/W; bitpos: [6]; default: 0;
 *  Configures lp_spi registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_SPI    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_SPI_M  (LP_PERI_PMS_WRITE_REE1_LP_SPI_V << LP_PERI_PMS_WRITE_REE1_LP_SPI_S)
#define LP_PERI_PMS_WRITE_REE1_LP_SPI_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_SPI_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_SPI : R/W; bitpos: [7]; default: 0;
 *  Configures lp_spi registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_SPI    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_SPI_M  (LP_PERI_PMS_WRITE_REE2_LP_SPI_V << LP_PERI_PMS_WRITE_REE2_LP_SPI_S)
#define LP_PERI_PMS_WRITE_REE2_LP_SPI_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_SPI_S  7
/** LP_PERI_PMS_LP_SPI_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_spi peri_apm configuration
 */
#define LP_PERI_PMS_LP_SPI_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_SPI_LOCK_M  (LP_PERI_PMS_LP_SPI_LOCK_V << LP_PERI_PMS_LP_SPI_LOCK_S)
#define LP_PERI_PMS_LP_SPI_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_SPI_LOCK_S  8

/** LP_PERI_PMS_LP_I2CMST_CTRL_REG register
 *  lp_i2cmst read/write control register
 */
#define LP_PERI_PMS_LP_I2CMST_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0x54)
/** LP_PERI_PMS_READ_TEE_LP_I2CMST : R/W; bitpos: [0]; default: 1;
 *  Configures lp_i2cmst registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_I2CMST    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_I2CMST_M  (LP_PERI_PMS_READ_TEE_LP_I2CMST_V << LP_PERI_PMS_READ_TEE_LP_I2CMST_S)
#define LP_PERI_PMS_READ_TEE_LP_I2CMST_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_I2CMST_S  0
/** LP_PERI_PMS_READ_REE0_LP_I2CMST : R/W; bitpos: [1]; default: 0;
 *  Configures lp_i2cmst registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_I2CMST    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_I2CMST_M  (LP_PERI_PMS_READ_REE0_LP_I2CMST_V << LP_PERI_PMS_READ_REE0_LP_I2CMST_S)
#define LP_PERI_PMS_READ_REE0_LP_I2CMST_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_I2CMST_S  1
/** LP_PERI_PMS_READ_REE1_LP_I2CMST : R/W; bitpos: [2]; default: 0;
 *  Configures lp_i2cmst registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_I2CMST    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_I2CMST_M  (LP_PERI_PMS_READ_REE1_LP_I2CMST_V << LP_PERI_PMS_READ_REE1_LP_I2CMST_S)
#define LP_PERI_PMS_READ_REE1_LP_I2CMST_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_I2CMST_S  2
/** LP_PERI_PMS_READ_REE2_LP_I2CMST : R/W; bitpos: [3]; default: 0;
 *  Configures lp_i2cmst registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_I2CMST    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_I2CMST_M  (LP_PERI_PMS_READ_REE2_LP_I2CMST_V << LP_PERI_PMS_READ_REE2_LP_I2CMST_S)
#define LP_PERI_PMS_READ_REE2_LP_I2CMST_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_I2CMST_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_I2CMST : R/W; bitpos: [4]; default: 1;
 *  Configures lp_i2cmst registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_I2CMST    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_I2CMST_M  (LP_PERI_PMS_WRITE_TEE_LP_I2CMST_V << LP_PERI_PMS_WRITE_TEE_LP_I2CMST_S)
#define LP_PERI_PMS_WRITE_TEE_LP_I2CMST_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_I2CMST_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_I2CMST : R/W; bitpos: [5]; default: 0;
 *  Configures lp_i2cmst registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_I2CMST    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_I2CMST_M  (LP_PERI_PMS_WRITE_REE0_LP_I2CMST_V << LP_PERI_PMS_WRITE_REE0_LP_I2CMST_S)
#define LP_PERI_PMS_WRITE_REE0_LP_I2CMST_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_I2CMST_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_I2CMST : R/W; bitpos: [6]; default: 0;
 *  Configures lp_i2cmst registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_I2CMST    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_I2CMST_M  (LP_PERI_PMS_WRITE_REE1_LP_I2CMST_V << LP_PERI_PMS_WRITE_REE1_LP_I2CMST_S)
#define LP_PERI_PMS_WRITE_REE1_LP_I2CMST_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_I2CMST_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_I2CMST : R/W; bitpos: [7]; default: 0;
 *  Configures lp_i2cmst registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_I2CMST    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_I2CMST_M  (LP_PERI_PMS_WRITE_REE2_LP_I2CMST_V << LP_PERI_PMS_WRITE_REE2_LP_I2CMST_S)
#define LP_PERI_PMS_WRITE_REE2_LP_I2CMST_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_I2CMST_S  7
/** LP_PERI_PMS_LP_I2CMST_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_i2cmst peri_apm configuration
 */
#define LP_PERI_PMS_LP_I2CMST_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_I2CMST_LOCK_M  (LP_PERI_PMS_LP_I2CMST_LOCK_V << LP_PERI_PMS_LP_I2CMST_LOCK_S)
#define LP_PERI_PMS_LP_I2CMST_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_I2CMST_LOCK_S  8

/** LP_PERI_PMS_LP_TRNG_CTRL_REG register
 *  lp_trng read/write control register
 */
#define LP_PERI_PMS_LP_TRNG_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0x58)
/** LP_PERI_PMS_READ_TEE_LP_TRNG : R/W; bitpos: [0]; default: 1;
 *  Configures lp_trng registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_TRNG    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_TRNG_M  (LP_PERI_PMS_READ_TEE_LP_TRNG_V << LP_PERI_PMS_READ_TEE_LP_TRNG_S)
#define LP_PERI_PMS_READ_TEE_LP_TRNG_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_TRNG_S  0
/** LP_PERI_PMS_READ_REE0_LP_TRNG : R/W; bitpos: [1]; default: 0;
 *  Configures lp_trng registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_TRNG    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_TRNG_M  (LP_PERI_PMS_READ_REE0_LP_TRNG_V << LP_PERI_PMS_READ_REE0_LP_TRNG_S)
#define LP_PERI_PMS_READ_REE0_LP_TRNG_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_TRNG_S  1
/** LP_PERI_PMS_READ_REE1_LP_TRNG : R/W; bitpos: [2]; default: 0;
 *  Configures lp_trng registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_TRNG    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_TRNG_M  (LP_PERI_PMS_READ_REE1_LP_TRNG_V << LP_PERI_PMS_READ_REE1_LP_TRNG_S)
#define LP_PERI_PMS_READ_REE1_LP_TRNG_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_TRNG_S  2
/** LP_PERI_PMS_READ_REE2_LP_TRNG : R/W; bitpos: [3]; default: 0;
 *  Configures lp_trng registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_TRNG    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_TRNG_M  (LP_PERI_PMS_READ_REE2_LP_TRNG_V << LP_PERI_PMS_READ_REE2_LP_TRNG_S)
#define LP_PERI_PMS_READ_REE2_LP_TRNG_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_TRNG_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_TRNG : R/W; bitpos: [4]; default: 1;
 *  Configures lp_trng registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_TRNG    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_TRNG_M  (LP_PERI_PMS_WRITE_TEE_LP_TRNG_V << LP_PERI_PMS_WRITE_TEE_LP_TRNG_S)
#define LP_PERI_PMS_WRITE_TEE_LP_TRNG_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_TRNG_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_TRNG : R/W; bitpos: [5]; default: 0;
 *  Configures lp_trng registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_TRNG    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_TRNG_M  (LP_PERI_PMS_WRITE_REE0_LP_TRNG_V << LP_PERI_PMS_WRITE_REE0_LP_TRNG_S)
#define LP_PERI_PMS_WRITE_REE0_LP_TRNG_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_TRNG_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_TRNG : R/W; bitpos: [6]; default: 0;
 *  Configures lp_trng registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_TRNG    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_TRNG_M  (LP_PERI_PMS_WRITE_REE1_LP_TRNG_V << LP_PERI_PMS_WRITE_REE1_LP_TRNG_S)
#define LP_PERI_PMS_WRITE_REE1_LP_TRNG_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_TRNG_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_TRNG : R/W; bitpos: [7]; default: 0;
 *  Configures lp_trng registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_TRNG    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_TRNG_M  (LP_PERI_PMS_WRITE_REE2_LP_TRNG_V << LP_PERI_PMS_WRITE_REE2_LP_TRNG_S)
#define LP_PERI_PMS_WRITE_REE2_LP_TRNG_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_TRNG_S  7
/** LP_PERI_PMS_LP_TRNG_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_trng peri_apm configuration
 */
#define LP_PERI_PMS_LP_TRNG_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_TRNG_LOCK_M  (LP_PERI_PMS_LP_TRNG_LOCK_V << LP_PERI_PMS_LP_TRNG_LOCK_S)
#define LP_PERI_PMS_LP_TRNG_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_TRNG_LOCK_S  8

/** LP_PERI_PMS_LP_ADC_CTRL_REG register
 *  lp_adc read/write control register
 */
#define LP_PERI_PMS_LP_ADC_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0x5c)
/** LP_PERI_PMS_READ_TEE_LP_ADC : R/W; bitpos: [0]; default: 1;
 *  Configures lp_adc registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_ADC    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_ADC_M  (LP_PERI_PMS_READ_TEE_LP_ADC_V << LP_PERI_PMS_READ_TEE_LP_ADC_S)
#define LP_PERI_PMS_READ_TEE_LP_ADC_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_ADC_S  0
/** LP_PERI_PMS_READ_REE0_LP_ADC : R/W; bitpos: [1]; default: 0;
 *  Configures lp_adc registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_ADC    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_ADC_M  (LP_PERI_PMS_READ_REE0_LP_ADC_V << LP_PERI_PMS_READ_REE0_LP_ADC_S)
#define LP_PERI_PMS_READ_REE0_LP_ADC_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_ADC_S  1
/** LP_PERI_PMS_READ_REE1_LP_ADC : R/W; bitpos: [2]; default: 0;
 *  Configures lp_adc registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_ADC    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_ADC_M  (LP_PERI_PMS_READ_REE1_LP_ADC_V << LP_PERI_PMS_READ_REE1_LP_ADC_S)
#define LP_PERI_PMS_READ_REE1_LP_ADC_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_ADC_S  2
/** LP_PERI_PMS_READ_REE2_LP_ADC : R/W; bitpos: [3]; default: 0;
 *  Configures lp_adc registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_ADC    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_ADC_M  (LP_PERI_PMS_READ_REE2_LP_ADC_V << LP_PERI_PMS_READ_REE2_LP_ADC_S)
#define LP_PERI_PMS_READ_REE2_LP_ADC_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_ADC_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_ADC : R/W; bitpos: [4]; default: 1;
 *  Configures lp_adc registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_ADC    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_ADC_M  (LP_PERI_PMS_WRITE_TEE_LP_ADC_V << LP_PERI_PMS_WRITE_TEE_LP_ADC_S)
#define LP_PERI_PMS_WRITE_TEE_LP_ADC_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_ADC_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_ADC : R/W; bitpos: [5]; default: 0;
 *  Configures lp_adc registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_ADC    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_ADC_M  (LP_PERI_PMS_WRITE_REE0_LP_ADC_V << LP_PERI_PMS_WRITE_REE0_LP_ADC_S)
#define LP_PERI_PMS_WRITE_REE0_LP_ADC_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_ADC_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_ADC : R/W; bitpos: [6]; default: 0;
 *  Configures lp_adc registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_ADC    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_ADC_M  (LP_PERI_PMS_WRITE_REE1_LP_ADC_V << LP_PERI_PMS_WRITE_REE1_LP_ADC_S)
#define LP_PERI_PMS_WRITE_REE1_LP_ADC_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_ADC_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_ADC : R/W; bitpos: [7]; default: 0;
 *  Configures lp_adc registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_ADC    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_ADC_M  (LP_PERI_PMS_WRITE_REE2_LP_ADC_V << LP_PERI_PMS_WRITE_REE2_LP_ADC_S)
#define LP_PERI_PMS_WRITE_REE2_LP_ADC_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_ADC_S  7
/** LP_PERI_PMS_LP_ADC_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_adc peri_apm configuration
 */
#define LP_PERI_PMS_LP_ADC_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_ADC_LOCK_M  (LP_PERI_PMS_LP_ADC_LOCK_V << LP_PERI_PMS_LP_ADC_LOCK_S)
#define LP_PERI_PMS_LP_ADC_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_ADC_LOCK_S  8

/** LP_PERI_PMS_LP_TOUCH_CTRL_REG register
 *  lp_touch read/write control register
 */
#define LP_PERI_PMS_LP_TOUCH_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0x60)
/** LP_PERI_PMS_READ_TEE_LP_TOUCH : R/W; bitpos: [0]; default: 1;
 *  Configures lp_touch registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_TOUCH    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_TOUCH_M  (LP_PERI_PMS_READ_TEE_LP_TOUCH_V << LP_PERI_PMS_READ_TEE_LP_TOUCH_S)
#define LP_PERI_PMS_READ_TEE_LP_TOUCH_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_TOUCH_S  0
/** LP_PERI_PMS_READ_REE0_LP_TOUCH : R/W; bitpos: [1]; default: 0;
 *  Configures lp_touch registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_TOUCH    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_TOUCH_M  (LP_PERI_PMS_READ_REE0_LP_TOUCH_V << LP_PERI_PMS_READ_REE0_LP_TOUCH_S)
#define LP_PERI_PMS_READ_REE0_LP_TOUCH_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_TOUCH_S  1
/** LP_PERI_PMS_READ_REE1_LP_TOUCH : R/W; bitpos: [2]; default: 0;
 *  Configures lp_touch registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_TOUCH    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_TOUCH_M  (LP_PERI_PMS_READ_REE1_LP_TOUCH_V << LP_PERI_PMS_READ_REE1_LP_TOUCH_S)
#define LP_PERI_PMS_READ_REE1_LP_TOUCH_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_TOUCH_S  2
/** LP_PERI_PMS_READ_REE2_LP_TOUCH : R/W; bitpos: [3]; default: 0;
 *  Configures lp_touch registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_TOUCH    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_TOUCH_M  (LP_PERI_PMS_READ_REE2_LP_TOUCH_V << LP_PERI_PMS_READ_REE2_LP_TOUCH_S)
#define LP_PERI_PMS_READ_REE2_LP_TOUCH_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_TOUCH_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_TOUCH : R/W; bitpos: [4]; default: 1;
 *  Configures lp_touch registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_TOUCH    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_TOUCH_M  (LP_PERI_PMS_WRITE_TEE_LP_TOUCH_V << LP_PERI_PMS_WRITE_TEE_LP_TOUCH_S)
#define LP_PERI_PMS_WRITE_TEE_LP_TOUCH_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_TOUCH_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_TOUCH : R/W; bitpos: [5]; default: 0;
 *  Configures lp_touch registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_TOUCH    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_TOUCH_M  (LP_PERI_PMS_WRITE_REE0_LP_TOUCH_V << LP_PERI_PMS_WRITE_REE0_LP_TOUCH_S)
#define LP_PERI_PMS_WRITE_REE0_LP_TOUCH_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_TOUCH_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_TOUCH : R/W; bitpos: [6]; default: 0;
 *  Configures lp_touch registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_TOUCH    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_TOUCH_M  (LP_PERI_PMS_WRITE_REE1_LP_TOUCH_V << LP_PERI_PMS_WRITE_REE1_LP_TOUCH_S)
#define LP_PERI_PMS_WRITE_REE1_LP_TOUCH_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_TOUCH_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_TOUCH : R/W; bitpos: [7]; default: 0;
 *  Configures lp_touch registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_TOUCH    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_TOUCH_M  (LP_PERI_PMS_WRITE_REE2_LP_TOUCH_V << LP_PERI_PMS_WRITE_REE2_LP_TOUCH_S)
#define LP_PERI_PMS_WRITE_REE2_LP_TOUCH_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_TOUCH_S  7
/** LP_PERI_PMS_LP_TOUCH_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_touch peri_apm configuration
 */
#define LP_PERI_PMS_LP_TOUCH_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_TOUCH_LOCK_M  (LP_PERI_PMS_LP_TOUCH_LOCK_V << LP_PERI_PMS_LP_TOUCH_LOCK_S)
#define LP_PERI_PMS_LP_TOUCH_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_TOUCH_LOCK_S  8

