espressif/esp-idf/components/soc/esp32s31/register/soc/lp_peri_pms_reg.h
/** LP_PERI_PMS_LP_MAILBOX_CTRL_REG register
 *  lp_mailbox read/write control register
 */
#define LP_PERI_PMS_LP_MAILBOX_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0x64)
/** LP_PERI_PMS_READ_TEE_LP_MAILBOX : R/W; bitpos: [0]; default: 1;
 *  Configures lp_mailbox registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_MAILBOX    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_MAILBOX_M  (LP_PERI_PMS_READ_TEE_LP_MAILBOX_V << LP_PERI_PMS_READ_TEE_LP_MAILBOX_S)
#define LP_PERI_PMS_READ_TEE_LP_MAILBOX_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_MAILBOX_S  0
/** LP_PERI_PMS_READ_REE0_LP_MAILBOX : R/W; bitpos: [1]; default: 0;
 *  Configures lp_mailbox registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_MAILBOX    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_MAILBOX_M  (LP_PERI_PMS_READ_REE0_LP_MAILBOX_V << LP_PERI_PMS_READ_REE0_LP_MAILBOX_S)
#define LP_PERI_PMS_READ_REE0_LP_MAILBOX_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_MAILBOX_S  1
/** LP_PERI_PMS_READ_REE1_LP_MAILBOX : R/W; bitpos: [2]; default: 0;
 *  Configures lp_mailbox registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_MAILBOX    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_MAILBOX_M  (LP_PERI_PMS_READ_REE1_LP_MAILBOX_V << LP_PERI_PMS_READ_REE1_LP_MAILBOX_S)
#define LP_PERI_PMS_READ_REE1_LP_MAILBOX_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_MAILBOX_S  2
/** LP_PERI_PMS_READ_REE2_LP_MAILBOX : R/W; bitpos: [3]; default: 0;
 *  Configures lp_mailbox registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_MAILBOX    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_MAILBOX_M  (LP_PERI_PMS_READ_REE2_LP_MAILBOX_V << LP_PERI_PMS_READ_REE2_LP_MAILBOX_S)
#define LP_PERI_PMS_READ_REE2_LP_MAILBOX_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_MAILBOX_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_MAILBOX : R/W; bitpos: [4]; default: 1;
 *  Configures lp_mailbox registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_MAILBOX    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_MAILBOX_M  (LP_PERI_PMS_WRITE_TEE_LP_MAILBOX_V << LP_PERI_PMS_WRITE_TEE_LP_MAILBOX_S)
#define LP_PERI_PMS_WRITE_TEE_LP_MAILBOX_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_MAILBOX_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_MAILBOX : R/W; bitpos: [5]; default: 0;
 *  Configures lp_mailbox registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_MAILBOX    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_MAILBOX_M  (LP_PERI_PMS_WRITE_REE0_LP_MAILBOX_V << LP_PERI_PMS_WRITE_REE0_LP_MAILBOX_S)
#define LP_PERI_PMS_WRITE_REE0_LP_MAILBOX_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_MAILBOX_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_MAILBOX : R/W; bitpos: [6]; default: 0;
 *  Configures lp_mailbox registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_MAILBOX    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_MAILBOX_M  (LP_PERI_PMS_WRITE_REE1_LP_MAILBOX_V << LP_PERI_PMS_WRITE_REE1_LP_MAILBOX_S)
#define LP_PERI_PMS_WRITE_REE1_LP_MAILBOX_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_MAILBOX_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_MAILBOX : R/W; bitpos: [7]; default: 0;
 *  Configures lp_mailbox registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_MAILBOX    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_MAILBOX_M  (LP_PERI_PMS_WRITE_REE2_LP_MAILBOX_V << LP_PERI_PMS_WRITE_REE2_LP_MAILBOX_S)
#define LP_PERI_PMS_WRITE_REE2_LP_MAILBOX_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_MAILBOX_S  7
/** LP_PERI_PMS_LP_MAILBOX_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_mailbox peri_apm configuration
 */
#define LP_PERI_PMS_LP_MAILBOX_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_MAILBOX_LOCK_M  (LP_PERI_PMS_LP_MAILBOX_LOCK_V << LP_PERI_PMS_LP_MAILBOX_LOCK_S)
#define LP_PERI_PMS_LP_MAILBOX_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_MAILBOX_LOCK_S  8

/** LP_PERI_PMS_LP_TSENS_CTRL_REG register
 *  lp_tsens read/write control register
 */
#define LP_PERI_PMS_LP_TSENS_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0x68)
/** LP_PERI_PMS_READ_TEE_LP_TSENS : R/W; bitpos: [0]; default: 1;
 *  Configures lp_tsens registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_TSENS    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_TSENS_M  (LP_PERI_PMS_READ_TEE_LP_TSENS_V << LP_PERI_PMS_READ_TEE_LP_TSENS_S)
#define LP_PERI_PMS_READ_TEE_LP_TSENS_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_TSENS_S  0
/** LP_PERI_PMS_READ_REE0_LP_TSENS : R/W; bitpos: [1]; default: 0;
 *  Configures lp_tsens registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_TSENS    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_TSENS_M  (LP_PERI_PMS_READ_REE0_LP_TSENS_V << LP_PERI_PMS_READ_REE0_LP_TSENS_S)
#define LP_PERI_PMS_READ_REE0_LP_TSENS_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_TSENS_S  1
/** LP_PERI_PMS_READ_REE1_LP_TSENS : R/W; bitpos: [2]; default: 0;
 *  Configures lp_tsens registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_TSENS    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_TSENS_M  (LP_PERI_PMS_READ_REE1_LP_TSENS_V << LP_PERI_PMS_READ_REE1_LP_TSENS_S)
#define LP_PERI_PMS_READ_REE1_LP_TSENS_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_TSENS_S  2
/** LP_PERI_PMS_READ_REE2_LP_TSENS : R/W; bitpos: [3]; default: 0;
 *  Configures lp_tsens registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_TSENS    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_TSENS_M  (LP_PERI_PMS_READ_REE2_LP_TSENS_V << LP_PERI_PMS_READ_REE2_LP_TSENS_S)
#define LP_PERI_PMS_READ_REE2_LP_TSENS_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_TSENS_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_TSENS : R/W; bitpos: [4]; default: 1;
 *  Configures lp_tsens registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_TSENS    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_TSENS_M  (LP_PERI_PMS_WRITE_TEE_LP_TSENS_V << LP_PERI_PMS_WRITE_TEE_LP_TSENS_S)
#define LP_PERI_PMS_WRITE_TEE_LP_TSENS_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_TSENS_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_TSENS : R/W; bitpos: [5]; default: 0;
 *  Configures lp_tsens registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_TSENS    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_TSENS_M  (LP_PERI_PMS_WRITE_REE0_LP_TSENS_V << LP_PERI_PMS_WRITE_REE0_LP_TSENS_S)
#define LP_PERI_PMS_WRITE_REE0_LP_TSENS_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_TSENS_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_TSENS : R/W; bitpos: [6]; default: 0;
 *  Configures lp_tsens registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_TSENS    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_TSENS_M  (LP_PERI_PMS_WRITE_REE1_LP_TSENS_V << LP_PERI_PMS_WRITE_REE1_LP_TSENS_S)
#define LP_PERI_PMS_WRITE_REE1_LP_TSENS_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_TSENS_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_TSENS : R/W; bitpos: [7]; default: 0;
 *  Configures lp_tsens registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_TSENS    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_TSENS_M  (LP_PERI_PMS_WRITE_REE2_LP_TSENS_V << LP_PERI_PMS_WRITE_REE2_LP_TSENS_S)
#define LP_PERI_PMS_WRITE_REE2_LP_TSENS_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_TSENS_S  7
/** LP_PERI_PMS_LP_TSENS_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_tsens peri_apm configuration
 */
#define LP_PERI_PMS_LP_TSENS_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_TSENS_LOCK_M  (LP_PERI_PMS_LP_TSENS_LOCK_V << LP_PERI_PMS_LP_TSENS_LOCK_S)
#define LP_PERI_PMS_LP_TSENS_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_TSENS_LOCK_S  8

