espressif/esp-idf/components/soc/esp32s31/register/soc/lp_peri_pms_reg.h
/** LP_PERI_PMS_LP_AHB_PDMA_CTRL_REG register
 *  lp_ahb_pdma read/write control register
 */
#define LP_PERI_PMS_LP_AHB_PDMA_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0x6c)
/** LP_PERI_PMS_READ_TEE_LP_AHB_PDMA : R/W; bitpos: [0]; default: 1;
 *  Configures lp_ahb_pdma registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_AHB_PDMA    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_AHB_PDMA_M  (LP_PERI_PMS_READ_TEE_LP_AHB_PDMA_V << LP_PERI_PMS_READ_TEE_LP_AHB_PDMA_S)
#define LP_PERI_PMS_READ_TEE_LP_AHB_PDMA_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_AHB_PDMA_S  0
/** LP_PERI_PMS_READ_REE0_LP_AHB_PDMA : R/W; bitpos: [1]; default: 0;
 *  Configures lp_ahb_pdma registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_AHB_PDMA    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_AHB_PDMA_M  (LP_PERI_PMS_READ_REE0_LP_AHB_PDMA_V << LP_PERI_PMS_READ_REE0_LP_AHB_PDMA_S)
#define LP_PERI_PMS_READ_REE0_LP_AHB_PDMA_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_AHB_PDMA_S  1
/** LP_PERI_PMS_READ_REE1_LP_AHB_PDMA : R/W; bitpos: [2]; default: 0;
 *  Configures lp_ahb_pdma registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_AHB_PDMA    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_AHB_PDMA_M  (LP_PERI_PMS_READ_REE1_LP_AHB_PDMA_V << LP_PERI_PMS_READ_REE1_LP_AHB_PDMA_S)
#define LP_PERI_PMS_READ_REE1_LP_AHB_PDMA_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_AHB_PDMA_S  2
/** LP_PERI_PMS_READ_REE2_LP_AHB_PDMA : R/W; bitpos: [3]; default: 0;
 *  Configures lp_ahb_pdma registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_AHB_PDMA    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_AHB_PDMA_M  (LP_PERI_PMS_READ_REE2_LP_AHB_PDMA_V << LP_PERI_PMS_READ_REE2_LP_AHB_PDMA_S)
#define LP_PERI_PMS_READ_REE2_LP_AHB_PDMA_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_AHB_PDMA_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_AHB_PDMA : R/W; bitpos: [4]; default: 1;
 *  Configures lp_ahb_pdma registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_AHB_PDMA    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_AHB_PDMA_M  (LP_PERI_PMS_WRITE_TEE_LP_AHB_PDMA_V << LP_PERI_PMS_WRITE_TEE_LP_AHB_PDMA_S)
#define LP_PERI_PMS_WRITE_TEE_LP_AHB_PDMA_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_AHB_PDMA_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_AHB_PDMA : R/W; bitpos: [5]; default: 0;
 *  Configures lp_ahb_pdma registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_AHB_PDMA    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_AHB_PDMA_M  (LP_PERI_PMS_WRITE_REE0_LP_AHB_PDMA_V << LP_PERI_PMS_WRITE_REE0_LP_AHB_PDMA_S)
#define LP_PERI_PMS_WRITE_REE0_LP_AHB_PDMA_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_AHB_PDMA_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_AHB_PDMA : R/W; bitpos: [6]; default: 0;
 *  Configures lp_ahb_pdma registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_AHB_PDMA    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_AHB_PDMA_M  (LP_PERI_PMS_WRITE_REE1_LP_AHB_PDMA_V << LP_PERI_PMS_WRITE_REE1_LP_AHB_PDMA_S)
#define LP_PERI_PMS_WRITE_REE1_LP_AHB_PDMA_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_AHB_PDMA_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_AHB_PDMA : R/W; bitpos: [7]; default: 0;
 *  Configures lp_ahb_pdma registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_AHB_PDMA    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_AHB_PDMA_M  (LP_PERI_PMS_WRITE_REE2_LP_AHB_PDMA_V << LP_PERI_PMS_WRITE_REE2_LP_AHB_PDMA_S)
#define LP_PERI_PMS_WRITE_REE2_LP_AHB_PDMA_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_AHB_PDMA_S  7
/** LP_PERI_PMS_LP_AHB_PDMA_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_ahb_pdma peri_apm configuration
 */
#define LP_PERI_PMS_LP_AHB_PDMA_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_AHB_PDMA_LOCK_M  (LP_PERI_PMS_LP_AHB_PDMA_LOCK_V << LP_PERI_PMS_LP_AHB_PDMA_LOCK_S)
#define LP_PERI_PMS_LP_AHB_PDMA_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_AHB_PDMA_LOCK_S  8

/** LP_PERI_PMS_LP_DAC_CTRL_REG register
 *  lp_dac read/write control register
 */
#define LP_PERI_PMS_LP_DAC_CTRL_REG (DR_REG_LP_PERI_PMS_BASE + 0x70)
/** LP_PERI_PMS_READ_TEE_LP_DAC : R/W; bitpos: [0]; default: 1;
 *  Configures lp_dac registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_TEE_LP_DAC    (BIT(0))
#define LP_PERI_PMS_READ_TEE_LP_DAC_M  (LP_PERI_PMS_READ_TEE_LP_DAC_V << LP_PERI_PMS_READ_TEE_LP_DAC_S)
#define LP_PERI_PMS_READ_TEE_LP_DAC_V  0x00000001U
#define LP_PERI_PMS_READ_TEE_LP_DAC_S  0
/** LP_PERI_PMS_READ_REE0_LP_DAC : R/W; bitpos: [1]; default: 0;
 *  Configures lp_dac registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE0_LP_DAC    (BIT(1))
#define LP_PERI_PMS_READ_REE0_LP_DAC_M  (LP_PERI_PMS_READ_REE0_LP_DAC_V << LP_PERI_PMS_READ_REE0_LP_DAC_S)
#define LP_PERI_PMS_READ_REE0_LP_DAC_V  0x00000001U
#define LP_PERI_PMS_READ_REE0_LP_DAC_S  1
/** LP_PERI_PMS_READ_REE1_LP_DAC : R/W; bitpos: [2]; default: 0;
 *  Configures lp_dac registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE1_LP_DAC    (BIT(2))
#define LP_PERI_PMS_READ_REE1_LP_DAC_M  (LP_PERI_PMS_READ_REE1_LP_DAC_V << LP_PERI_PMS_READ_REE1_LP_DAC_S)
#define LP_PERI_PMS_READ_REE1_LP_DAC_V  0x00000001U
#define LP_PERI_PMS_READ_REE1_LP_DAC_S  2
/** LP_PERI_PMS_READ_REE2_LP_DAC : R/W; bitpos: [3]; default: 0;
 *  Configures lp_dac registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define LP_PERI_PMS_READ_REE2_LP_DAC    (BIT(3))
#define LP_PERI_PMS_READ_REE2_LP_DAC_M  (LP_PERI_PMS_READ_REE2_LP_DAC_V << LP_PERI_PMS_READ_REE2_LP_DAC_S)
#define LP_PERI_PMS_READ_REE2_LP_DAC_V  0x00000001U
#define LP_PERI_PMS_READ_REE2_LP_DAC_S  3
/** LP_PERI_PMS_WRITE_TEE_LP_DAC : R/W; bitpos: [4]; default: 1;
 *  Configures lp_dac registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_TEE_LP_DAC    (BIT(4))
#define LP_PERI_PMS_WRITE_TEE_LP_DAC_M  (LP_PERI_PMS_WRITE_TEE_LP_DAC_V << LP_PERI_PMS_WRITE_TEE_LP_DAC_S)
#define LP_PERI_PMS_WRITE_TEE_LP_DAC_V  0x00000001U
#define LP_PERI_PMS_WRITE_TEE_LP_DAC_S  4
/** LP_PERI_PMS_WRITE_REE0_LP_DAC : R/W; bitpos: [5]; default: 0;
 *  Configures lp_dac registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE0_LP_DAC    (BIT(5))
#define LP_PERI_PMS_WRITE_REE0_LP_DAC_M  (LP_PERI_PMS_WRITE_REE0_LP_DAC_V << LP_PERI_PMS_WRITE_REE0_LP_DAC_S)
#define LP_PERI_PMS_WRITE_REE0_LP_DAC_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE0_LP_DAC_S  5
/** LP_PERI_PMS_WRITE_REE1_LP_DAC : R/W; bitpos: [6]; default: 0;
 *  Configures lp_dac registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE1_LP_DAC    (BIT(6))
#define LP_PERI_PMS_WRITE_REE1_LP_DAC_M  (LP_PERI_PMS_WRITE_REE1_LP_DAC_V << LP_PERI_PMS_WRITE_REE1_LP_DAC_S)
#define LP_PERI_PMS_WRITE_REE1_LP_DAC_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE1_LP_DAC_S  6
/** LP_PERI_PMS_WRITE_REE2_LP_DAC : R/W; bitpos: [7]; default: 0;
 *  Configures lp_dac registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define LP_PERI_PMS_WRITE_REE2_LP_DAC    (BIT(7))
#define LP_PERI_PMS_WRITE_REE2_LP_DAC_M  (LP_PERI_PMS_WRITE_REE2_LP_DAC_V << LP_PERI_PMS_WRITE_REE2_LP_DAC_S)
#define LP_PERI_PMS_WRITE_REE2_LP_DAC_V  0x00000001U
#define LP_PERI_PMS_WRITE_REE2_LP_DAC_S  7
/** LP_PERI_PMS_LP_DAC_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock lp_dac peri_apm configuration
 */
#define LP_PERI_PMS_LP_DAC_LOCK    (BIT(8))
#define LP_PERI_PMS_LP_DAC_LOCK_M  (LP_PERI_PMS_LP_DAC_LOCK_V << LP_PERI_PMS_LP_DAC_LOCK_S)
#define LP_PERI_PMS_LP_DAC_LOCK_V  0x00000001U
#define LP_PERI_PMS_LP_DAC_LOCK_S  8

