espressif/esp-idf/components/soc/esp32s31/register/soc/lp_peri_pms_reg.h
/** LP_PERI_PMS_LP_PERI0_0_REG register
 *  LP_PERI0 PMS configuration & info register
 */
#define LP_PERI_PMS_LP_PERI0_0_REG (DR_REG_LP_PERI_PMS_BASE + 0x200)
/** LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_CLR : WT; bitpos: [0]; default: 0;
 *  Configures whether or not to clear lp_peri0 peri_pms_record_reg.
 *  0: No clear
 *  1: Clear peri_pms_record_reg
 */
#define LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_CLR    (BIT(0))
#define LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_CLR_M  (LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_CLR_V << LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_CLR_S)
#define LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_CLR_V  0x00000001U
#define LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_CLR_S  0
/** LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_DET : RO; bitpos: [1]; default: 0;
 *  Represents whether the lp_peri0 pms has been triggered.
 *  0: No triggered
 *  1: Has been triggered
 */
#define LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_DET    (BIT(1))
#define LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_DET_M  (LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_DET_V << LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_DET_S)
#define LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_DET_V  0x00000001U
#define LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_DET_S  1
/** LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_ID : RO; bitpos: [7:2]; default: 0;
 *  Represents the master id when lp_peri0 pms has been triggered.
 */
#define LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_ID    0x0000003FU
#define LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_ID_M  (LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_ID_V << LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_ID_S)
#define LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_ID_V  0x0000003FU
#define LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_ID_S  2
/** LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_MODE : RO; bitpos: [9:8]; default: 0;
 *  Represents the security mode when lp_peri0 pms has been triggered.
 */
#define LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_MODE    0x00000003U
#define LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_MODE_M  (LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_MODE_V << LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_MODE_S)
#define LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_MODE_V  0x00000003U
#define LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_MODE_S  8

/** LP_PERI_PMS_LP_PERI0_1_REG register
 *  LP_PERI0 PMS exception addr record register
 */
#define LP_PERI_PMS_LP_PERI0_1_REG (DR_REG_LP_PERI_PMS_BASE + 0x204)
/** LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_ADDR : RO; bitpos: [23:0]; default: 0;
 *  Represents the access address (bit27~bit0) when lp_peri0 pms has been triggered.
 */
#define LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_ADDR    0x00FFFFFFU
#define LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_ADDR_M  (LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_ADDR_V << LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_ADDR_S)
#define LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_ADDR_V  0x00FFFFFFU
#define LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_ADDR_S  0
/** LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_ADDR_CONST : HRO; bitpos: [31:24]; default: 32;
 *  Represents the access address (bit31~bit28) when lp_peri0 pms has been triggered.
 */
#define LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_ADDR_CONST    0x000000FFU
#define LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_ADDR_CONST_M  (LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_ADDR_CONST_V << LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_ADDR_CONST_S)
#define LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_ADDR_CONST_V  0x000000FFU
#define LP_PERI_PMS_LP_PERI0_PMS_EXCEPTION_ADDR_CONST_S  24

/** LP_PERI_PMS_LP_PERI1_0_REG register
 *  LP_PERI1 PMS configuration & info register
 */
#define LP_PERI_PMS_LP_PERI1_0_REG (DR_REG_LP_PERI_PMS_BASE + 0x208)
/** LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_CLR : WT; bitpos: [0]; default: 0;
 *  Configures whether or not to clear lp_peri1 peri_pms_record_reg.
 *  0: No clear
 *  1: Clear peri_pms_record_reg
 */
#define LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_CLR    (BIT(0))
#define LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_CLR_M  (LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_CLR_V << LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_CLR_S)
#define LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_CLR_V  0x00000001U
#define LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_CLR_S  0
/** LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_DET : RO; bitpos: [1]; default: 0;
 *  Represents whether the lp_peri1 pms has been triggered.
 *  0: No triggered
 *  1: Has been triggered
 */
#define LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_DET    (BIT(1))
#define LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_DET_M  (LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_DET_V << LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_DET_S)
#define LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_DET_V  0x00000001U
#define LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_DET_S  1
/** LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_ID : RO; bitpos: [7:2]; default: 0;
 *  Represents the master id when lp_peri1 pms has been triggered.
 */
#define LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_ID    0x0000003FU
#define LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_ID_M  (LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_ID_V << LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_ID_S)
#define LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_ID_V  0x0000003FU
#define LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_ID_S  2
/** LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_MODE : RO; bitpos: [9:8]; default: 0;
 *  Represents the security mode when lp_peri1 pms has been triggered.
 */
#define LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_MODE    0x00000003U
#define LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_MODE_M  (LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_MODE_V << LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_MODE_S)
#define LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_MODE_V  0x00000003U
#define LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_MODE_S  8

/** LP_PERI_PMS_LP_PERI1_1_REG register
 *  LP_PERI1 PMS exception addr record register
 */
#define LP_PERI_PMS_LP_PERI1_1_REG (DR_REG_LP_PERI_PMS_BASE + 0x20c)
/** LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_ADDR : RO; bitpos: [23:0]; default: 0;
 *  Represents the access address (bit27~bit0) when lp_peri1 pms has been triggered.
 */
#define LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_ADDR    0x00FFFFFFU
#define LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_ADDR_M  (LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_ADDR_V << LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_ADDR_S)
#define LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_ADDR_V  0x00FFFFFFU
#define LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_ADDR_S  0
/** LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_ADDR_CONST : HRO; bitpos: [31:24]; default: 32;
 *  Represents the access address (bit31~bit28) when lp_peri1 pms has been triggered.
 */
#define LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_ADDR_CONST    0x000000FFU
#define LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_ADDR_CONST_M  (LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_ADDR_CONST_V << LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_ADDR_CONST_S)
#define LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_ADDR_CONST_V  0x000000FFU
#define LP_PERI_PMS_LP_PERI1_PMS_EXCEPTION_ADDR_CONST_S  24

/** LP_PERI_PMS_INT_EN_REG register
 *  APM interrupt enable register
 */
#define LP_PERI_PMS_INT_EN_REG (DR_REG_LP_PERI_PMS_BASE + 0x300)
/** LP_PERI_PMS_LP_PERI1_PMS_INT_EN : R/W; bitpos: [0]; default: 0;
 *  Configures to enable lp_peri1 pms interrupt.
 *  0: disable
 *  1: enable
 */
#define LP_PERI_PMS_LP_PERI1_PMS_INT_EN    (BIT(0))
#define LP_PERI_PMS_LP_PERI1_PMS_INT_EN_M  (LP_PERI_PMS_LP_PERI1_PMS_INT_EN_V << LP_PERI_PMS_LP_PERI1_PMS_INT_EN_S)
#define LP_PERI_PMS_LP_PERI1_PMS_INT_EN_V  0x00000001U
#define LP_PERI_PMS_LP_PERI1_PMS_INT_EN_S  0
/** LP_PERI_PMS_LP_PERI0_PMS_INT_EN : R/W; bitpos: [1]; default: 0;
 *  Configures to enable lp_peri0 pms interrupt.
 *  0: disable
 *  1: enable
 */
#define LP_PERI_PMS_LP_PERI0_PMS_INT_EN    (BIT(1))
#define LP_PERI_PMS_LP_PERI0_PMS_INT_EN_M  (LP_PERI_PMS_LP_PERI0_PMS_INT_EN_V << LP_PERI_PMS_LP_PERI0_PMS_INT_EN_S)
#define LP_PERI_PMS_LP_PERI0_PMS_INT_EN_V  0x00000001U
#define LP_PERI_PMS_LP_PERI0_PMS_INT_EN_S  1

