espressif/esp-idf/components/soc/esp32s31/register/soc/lp_peri_pms_reg.h
/** LP_PERI_PMS_BUS_ERR_CONF_REG register
 *  Clock gating register
 */
#define LP_PERI_PMS_BUS_ERR_CONF_REG (DR_REG_LP_PERI_PMS_BASE + 0x7f0)
/** LP_PERI_PMS_BUS_ERR_RESP_EN : R/W; bitpos: [0]; default: 0;
 *  Configures whether return error response to cpu when access blocked
 *  0: disable error response
 *  1: enable error response
 */
#define LP_PERI_PMS_BUS_ERR_RESP_EN    (BIT(0))
#define LP_PERI_PMS_BUS_ERR_RESP_EN_M  (LP_PERI_PMS_BUS_ERR_RESP_EN_V << LP_PERI_PMS_BUS_ERR_RESP_EN_S)
#define LP_PERI_PMS_BUS_ERR_RESP_EN_V  0x00000001U
#define LP_PERI_PMS_BUS_ERR_RESP_EN_S  0

/** LP_PERI_PMS_CLOCK_GATE_REG register
 *  Clock gating register
 */
#define LP_PERI_PMS_CLOCK_GATE_REG (DR_REG_LP_PERI_PMS_BASE + 0x7f8)
/** LP_PERI_PMS_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Configures whether to keep the clock always on.
 *  0: enable automatic clock gating
 *  1: keep the clock always on
 */
#define LP_PERI_PMS_CLK_EN    (BIT(0))
#define LP_PERI_PMS_CLK_EN_M  (LP_PERI_PMS_CLK_EN_V << LP_PERI_PMS_CLK_EN_S)
#define LP_PERI_PMS_CLK_EN_V  0x00000001U
#define LP_PERI_PMS_CLK_EN_S  0

/** LP_PERI_PMS_DATE_REG register
 *  Version control register
 */
#define LP_PERI_PMS_DATE_REG (DR_REG_LP_PERI_PMS_BASE + 0x7fc)
/** LP_PERI_PMS_DATE : R/W; bitpos: [27:0]; default: 38834752;
 *  Version control register
 */
#define LP_PERI_PMS_DATE    0x0FFFFFFFU
#define LP_PERI_PMS_DATE_M  (LP_PERI_PMS_DATE_V << LP_PERI_PMS_DATE_S)
#define LP_PERI_PMS_DATE_V  0x0FFFFFFFU
#define LP_PERI_PMS_DATE_S  0

#ifdef __cplusplus
}
#endif
